bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_HALT_POS (3)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_HALT_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_RESERVED_BIT_4_4_POS (4)
#define SYS_CPU1_INT_HALT_CLK_OP_RESERVED_BIT_4_4_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_RXEVT_SEL_POS (5)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_RXEVT_SEL_MASK (0x3)

#define SYS_CPU1_INT_HALT_CLK_OP_RESERVED_7_7_POS (7)
#define SYS_CPU1_INT_HALT_CLK_OP_RESERVED_7_7_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_OFFSET_POS (8)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_OFFSET_MASK (0xffffff)

#define SYS_CPU_CLK_DIV_MODE1_ADDR (SOC_SYS_REG_BASE + (0x8 << 2))

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_CORE_POS (0)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_CORE_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE1_CKDIV_CORE_POS (2)
#define SYS_CPU_CLK_DIV_MODE1_CKDIV_CORE_MASK (0xf)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_FLASH_POS (6)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_FLASH_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE1_CKDIV_FLASH_POS (8)
#define SYS_CPU_CLK_DIV_MODE1_CKDIV_FLASH_MASK (0x7)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_AUXS_POS (11)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_AUXS_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE1_CKDIV_AUXS_POS (13)
#define SYS_CPU_CLK_DIV_MODE1_CKDIV_AUXS_MASK (0x3f)

#define SYS_CPU_CLK_DIV_MODE1_CKDIV_26MO_POS (19)
#define SYS_CPU_CLK_DIV_MODE1_CKDIV_26MO_MASK (0x7)

#define SYS_CPU_CLK_DIV_MODE1_RESERVED_22_23_POS (22)
#define SYS_CPU_CLK_DIV_MODE1_RESERVED_22_23_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE1_PHASE_CFG_960M_POS (24)
#define SYS_CPU_CLK_DIV_MODE1_PHASE_CFG_960M_MASK (0xff)

#define SYS_CPU_CLK_DIV_MODE2_ADDR (SOC_SYS_REG_BASE + (0x9 << 2))

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2C0_POS (0)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2C0_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2C3_POS (1)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2C3_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_UART0_POS (2)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_UART0_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_UART1_POS (3)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_UART1_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_UART2_POS (4)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_UART2_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_UART3_POS (5)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_UART3_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_UART4_POS (6)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_UART4_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SPI0_POS (7)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SPI0_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SPI1_POS (8)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SPI1_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SPI2_POS (9)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SPI2_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SPI3_POS (10)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SPI3_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2S0_POS (11)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2S0_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S0_POS (12)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S0_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2S1_POS (14)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2S1_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S1_POS (15)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S1_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2S2_POS (17)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2S2_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S2_POS (18)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S2_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2S3_POS (20)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2S3_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S3_POS (21)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S3_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2S4_POS (23)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I2S4_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S4_POS (24)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S4_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SADC_POS (26)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SADC_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I3C_POS (27)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_I3C_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_TIM0_POS (28)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_TIM0_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_TIM1_POS (29)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_TIM1_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_TIM2_POS (30)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_TIM2_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_TIM3_POS (31)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_TIM3_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE3_ADDR (SOC_SYS_REG_BASE + (0xa << 2))

#define SYS_CPU_CLK_DIV_MODE3_CKSEL_PWM0_POS (0)
#define SYS_CPU_CLK_DIV_MODE3_CKSEL_PWM0_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE3_CKSEL_CAN0_POS (1)
#define SYS_CPU_CLK_DIV_MODE3_CKSEL_CAN0_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE3_CKSEL_CAN1_POS (2)
#define SYS_CPU_CLK_DIV_MODE3_CKSEL_CAN1_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE3_CKSEL_SCR0_POS (3)
#define SYS_CPU_CLK_DIV_MODE3_CKSEL_SCR0_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE3_CKSEL_AUDIO_POS (4)
#define SYS_CPU_CLK_DIV_MODE3_CKSEL_AUDIO_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE3_CKDIV_AUDIO_POS (5)
#define SYS_CPU_CLK_DIV_MODE3_CKDIV_AUDIO_MASK (0x7)

#define SYS_CPU_CLK_DIV_MODE3_CKSEL_AUDIF0_POS (8)
#define SYS_CPU_CLK_DIV_MODE3_CKSEL_AUDIF0_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE3_CKDIV_AUDIF0_POS (9)
#define SYS_CPU_CLK_DIV_MODE3_CKDIV_AUDIF0_MASK (0x7)

#define SYS_CPU_CLK_DIV_MODE3_CKSEL_AUDIF1_POS (12)
#define SYS_CPU_CLK_DIV_MODE3_CKSEL_AUDIF1_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE3_CKDIV_AUDIF1_POS (13)
#define SYS_CPU_CLK_DIV_MODE3_CKDIV_AUDIF1_MASK (0x7)

#define SYS_CPU_CLK_DIV_MODE3_CKDIV_I2SO_POS (16)
#define SYS_CPU_CLK_DIV_MODE3_CKDIV_I2SO_MASK (0x7)

#define SYS_CPU_CLK_DIV_MODE3_CKSEL_AUXS_ENET_POS (19)
#define SYS_CPU_CLK_DIV_MODE3_CKSEL_AUXS_ENET_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE3_CKDIV_AUXS_ENET_POS (20)
#define SYS_CPU_CLK_DIV_MODE3_CKDIV_AUXS_ENET_MASK (0xf)

