bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_CPU_CLK_DIV_MODE3_CKSEL_TRACE_POS (24)
#define SYS_CPU_CLK_DIV_MODE3_CKSEL_TRACE_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE3_CKDIV_TRACE_POS (25)
#define SYS_CPU_CLK_DIV_MODE3_CKDIV_TRACE_MASK (0x7)

#define SYS_CPU_CLK_DIV_MODE3_RESERVED_28_31_POS (28)
#define SYS_CPU_CLK_DIV_MODE3_RESERVED_28_31_MASK (0xf)

#define SYS_CPU_ANASPI_FREQ_ADDR (SOC_SYS_REG_BASE + (0xb << 2))

#define SYS_CPU_ANASPI_FREQ_ANASPI_FREQ_POS (0)
#define SYS_CPU_ANASPI_FREQ_ANASPI_FREQ_MASK (0x3f)

#define SYS_CPU_ANASPI_FREQ_RESERVED_BIT_6_31_POS (6)
#define SYS_CPU_ANASPI_FREQ_RESERVED_BIT_6_31_MASK (0x3ffffff)

#define SYS_CPU_DEVICE_CLK_ENABLE_ADDR (SOC_SYS_REG_BASE + (0xc << 2))

#define SYS_CPU_DEVICE_CLK_ENABLE_TIM0_CKEN_POS (0)
#define SYS_CPU_DEVICE_CLK_ENABLE_TIM0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_TIM1_CKEN_POS (1)
#define SYS_CPU_DEVICE_CLK_ENABLE_TIM1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_TIM2_CKEN_POS (2)
#define SYS_CPU_DEVICE_CLK_ENABLE_TIM2_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_TIM3_CKEN_POS (3)
#define SYS_CPU_DEVICE_CLK_ENABLE_TIM3_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART0_CKEN_POS (4)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART1_CKEN_POS (5)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART2_CKEN_POS (6)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART2_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART3_CKEN_POS (7)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART3_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART4_CKEN_POS (8)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART4_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SPI0_CKEN_POS (9)
#define SYS_CPU_DEVICE_CLK_ENABLE_SPI0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SPI1_CKEN_POS (10)
#define SYS_CPU_DEVICE_CLK_ENABLE_SPI1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SPI2_CKEN_POS (11)
#define SYS_CPU_DEVICE_CLK_ENABLE_SPI2_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SPI3_CKEN_POS (12)
#define SYS_CPU_DEVICE_CLK_ENABLE_SPI3_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SADC_CKEN_POS (13)
#define SYS_CPU_DEVICE_CLK_ENABLE_SADC_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_PWM0_CKEN_POS (14)
#define SYS_CPU_DEVICE_CLK_ENABLE_PWM0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_OTP_CKEN_POS (15)
#define SYS_CPU_DEVICE_CLK_ENABLE_OTP_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I3C_CKEN_POS (16)
#define SYS_CPU_DEVICE_CLK_ENABLE_I3C_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I2S0_CKEN_POS (17)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2S0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I2S1_CKEN_POS (18)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2S1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I2S2_CKEN_POS (19)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2S2_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I2S3_CKEN_POS (20)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2S3_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I2S4_CKEN_POS (21)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2S4_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I2C0_CKEN_POS (22)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2C0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I2C3_CKEN_POS (23)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2C3_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_IRDA0_CKEN_POS (24)
#define SYS_CPU_DEVICE_CLK_ENABLE_IRDA0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_IRDA1_CKEN_POS (25)
#define SYS_CPU_DEVICE_CLK_ENABLE_IRDA1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_IRDA2_CKEN_POS (26)
#define SYS_CPU_DEVICE_CLK_ENABLE_IRDA2_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_IRDA3_CKEN_POS (27)
#define SYS_CPU_DEVICE_CLK_ENABLE_IRDA3_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_CAN0_CKEN_POS (28)
#define SYS_CPU_DEVICE_CLK_ENABLE_CAN0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_CAN1_CKEN_POS (29)
#define SYS_CPU_DEVICE_CLK_ENABLE_CAN1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_LIN0_CKEN_POS (30)
#define SYS_CPU_DEVICE_CLK_ENABLE_LIN0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SCR0_CKEN_POS (31)
#define SYS_CPU_DEVICE_CLK_ENABLE_SCR0_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_ADDR (SOC_SYS_REG_BASE + (0xd << 2))

#define SYS_RESERVER_REG0XD_AUDIO_CKEN_POS (0)
#define SYS_RESERVER_REG0XD_AUDIO_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_AUDIF0_CKEN_POS (1)
#define SYS_RESERVER_REG0XD_AUDIF0_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_AUDIF1_CKEN_POS (2)
#define SYS_RESERVER_REG0XD_AUDIF1_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_I2SO_CKEN_POS (3)
#define SYS_RESERVER_REG0XD_I2SO_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_CEC_CKEN_POS (4)
#define SYS_RESERVER_REG0XD_CEC_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_XDAC0_CKEN_POS (5)
#define SYS_RESERVER_REG0XD_XDAC0_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_XDAC1_CKEN_POS (6)
#define SYS_RESERVER_REG0XD_XDAC1_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_AUXS_CKEN_POS (7)
#define SYS_RESERVER_REG0XD_AUXS_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_AUXS_ENET_CKEN_POS (8)
#define SYS_RESERVER_REG0XD_AUXS_ENET_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_SIG_26MS_CKEN_POS (9)
#define SYS_RESERVER_REG0XD_SIG_26MS_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_SIG_32KS_CKEN_POS (10)
#define SYS_RESERVER_REG0XD_SIG_32KS_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_SIG_26MO_CKEN_POS (11)
#define SYS_RESERVER_REG0XD_SIG_26MO_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_SIG_240M_CKEN_POS (12)
#define SYS_RESERVER_REG0XD_SIG_240M_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_SIG_320M_CKEN_POS (13)
#define SYS_RESERVER_REG0XD_SIG_320M_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_SIG_480M_CKEN_POS (14)
#define SYS_RESERVER_REG0XD_SIG_480M_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_SIG_160M_CKEN_POS (15)
#define SYS_RESERVER_REG0XD_SIG_160M_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_SIG_120M_CKEN_POS (16)
#define SYS_RESERVER_REG0XD_SIG_120M_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_TRACE_CKEN_POS (17)
#define SYS_RESERVER_REG0XD_TRACE_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_RESERVED_18_21_POS (18)
#define SYS_RESERVER_REG0XD_RESERVED_18_21_MASK (0xf)

#define SYS_RESERVER_REG0XD_WLSS_CKEN_POS (22)
#define SYS_RESERVER_REG0XD_WLSS_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_BTDM_CKEN_POS (23)
#define SYS_RESERVER_REG0XD_BTDM_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_XVER_CKEN_POS (24)
#define SYS_RESERVER_REG0XD_XVER_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_MAC_CKEN_POS (25)
#define SYS_RESERVER_REG0XD_MAC_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_PHY_CKEN_POS (26)
#define SYS_RESERVER_REG0XD_PHY_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_THREAD_CKEN_POS (27)
#define SYS_RESERVER_REG0XD_THREAD_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_BK24_CKEN_POS (28)
#define SYS_RESERVER_REG0XD_BK24_CKEN_MASK (0x1)

