bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_RESERVER_REG0XD_RF_CKEN_POS (29)
#define SYS_RESERVER_REG0XD_RF_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_OFDM_CKEN_POS (30)
#define SYS_RESERVER_REG0XD_OFDM_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_RESERVED_31_31_POS (31)
#define SYS_RESERVER_REG0XD_RESERVED_31_31_MASK (0x1)

#define SYS_RESERVER_REG0XF_ADDR (SOC_SYS_REG_BASE + (0xf << 2))

#define SYS_RESERVER_REG0XF_RESERVED_0_0_POS (0)
#define SYS_RESERVER_REG0XF_RESERVED_0_0_MASK (0x1)

#define SYS_RESERVER_REG0XF_RESERVED_1_1_POS (1)
#define SYS_RESERVER_REG0XF_RESERVED_1_1_MASK (0x1)

#define SYS_RESERVER_REG0XF_RESERVED_2_2_POS (2)
#define SYS_RESERVER_REG0XF_RESERVED_2_2_MASK (0x1)

#define SYS_RESERVER_REG0XF_MACP_MEM_RET_POS (3)
#define SYS_RESERVER_REG0XF_MACP_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_PHYP_MEM_RET_POS (4)
#define SYS_RESERVER_REG0XF_PHYP_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_THREAD_MEM_RET_POS (5)
#define SYS_RESERVER_REG0XF_THREAD_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_ENCP_MEM_RET_POS (6)
#define SYS_RESERVER_REG0XF_ENCP_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_CAN0_MEM_RET_POS (7)
#define SYS_RESERVER_REG0XF_CAN0_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_CAN1_MEM_RET_POS (8)
#define SYS_RESERVER_REG0XF_CAN1_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_IRDA0_MEM_RET_POS (9)
#define SYS_RESERVER_REG0XF_IRDA0_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_IRDA1_MEM_RET_POS (10)
#define SYS_RESERVER_REG0XF_IRDA1_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_DMA0_MEM_RET_POS (11)
#define SYS_RESERVER_REG0XF_DMA0_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_SPI1_MEM_RET_POS (12)
#define SYS_RESERVER_REG0XF_SPI1_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_SPI2_MEM_RET_POS (13)
#define SYS_RESERVER_REG0XF_SPI2_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_UART1_MEM_RET_POS (14)
#define SYS_RESERVER_REG0XF_UART1_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_UART2_MEM_RET_POS (15)
#define SYS_RESERVER_REG0XF_UART2_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_UART3_MEM_RET_POS (16)
#define SYS_RESERVER_REG0XF_UART3_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_UART0_MEM_RET_POS (17)
#define SYS_RESERVER_REG0XF_UART0_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_SPI0_MEM_RET_POS (18)
#define SYS_RESERVER_REG0XF_SPI0_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_FLSH_MEM_RET_POS (19)
#define SYS_RESERVER_REG0XF_FLSH_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_AUDP_MEM_RET_POS (20)
#define SYS_RESERVER_REG0XF_AUDP_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_I3C_MEM_RET_POS (21)
#define SYS_RESERVER_REG0XF_I3C_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_XVR_MEM_RET_POS (22)
#define SYS_RESERVER_REG0XF_XVR_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_RESERVED_23_23_POS (23)
#define SYS_RESERVER_REG0XF_RESERVED_23_23_MASK (0x1)

#define SYS_RESERVER_REG0XF_BK24_MEM_RET_POS (24)
#define SYS_RESERVER_REG0XF_BK24_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_IRDA2_MEM_RET_POS (25)
#define SYS_RESERVER_REG0XF_IRDA2_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_IRDA3_MEM_RET_POS (26)
#define SYS_RESERVER_REG0XF_IRDA3_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_SPI3_MEM_RET_POS (27)
#define SYS_RESERVER_REG0XF_SPI3_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_UART4_MEM_RET_POS (28)
#define SYS_RESERVER_REG0XF_UART4_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_CPU0_MEM_RET_POS (29)
#define SYS_RESERVER_REG0XF_CPU0_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_CPU1_MEM_RET_POS (30)
#define SYS_RESERVER_REG0XF_CPU1_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0XF_CORESIGHT_MEM_RET_POS (31)
#define SYS_RESERVER_REG0XF_CORESIGHT_MEM_RET_MASK (0x1)

#define SYS_RESERVER_REG0X10_ADDR (SOC_SYS_REG_BASE + (0x10 << 2))

#define SYS_RESERVER_REG0X10_PWD_CPU1_POS (0)
#define SYS_RESERVER_REG0X10_PWD_CPU1_MASK (0x1)

#define SYS_RESERVER_REG0X10_PWD_VEHP_POS (1)
#define SYS_RESERVER_REG0X10_PWD_VEHP_MASK (0x1)

#define SYS_RESERVER_REG0X10_PWD_WRLS_POS (2)
#define SYS_RESERVER_REG0X10_PWD_WRLS_MASK (0x1)

#define SYS_RESERVER_REG0X10_ROM_PGEN_POS (3)
#define SYS_RESERVER_REG0X10_ROM_PGEN_MASK (0x1)

#define SYS_RESERVER_REG0X10_CPU1_ISOLATE_STATE_POS (4)
#define SYS_RESERVER_REG0X10_CPU1_ISOLATE_STATE_MASK (0x1)

#define SYS_RESERVER_REG0X10_VEHP_ISOLATE_STATE_POS (5)
#define SYS_RESERVER_REG0X10_VEHP_ISOLATE_STATE_MASK (0x1)

#define SYS_RESERVER_REG0X10_WRLS_ISOLATE_STATE_POS (6)
#define SYS_RESERVER_REG0X10_WRLS_ISOLATE_STATE_MASK (0x1)

#define SYS_RESERVER_REG0X10_RESERVED_7_30_POS (7)
#define SYS_RESERVER_REG0X10_RESERVED_7_30_MASK (0xffffff)

#define SYS_RESERVER_REG0X10_BUSMATRIX_BUSY_POS (31)
#define SYS_RESERVER_REG0X10_BUSMATRIX_BUSY_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_ADDR (SOC_SYS_REG_BASE + (0x11 << 2))

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_GLOBAL_POS (0)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_GLOBAL_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_FLASH_IDLE_POS (1)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_FLASH_IDLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_BUS_IDLE_BYPASS_POS (2)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_BUS_IDLE_BYPASS_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU0_WFI_POS (3)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU0_WFI_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU1_WFI_POS (4)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU1_WFI_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_BIT_5_11_POS (5)
#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_BIT_5_11_MASK (0x7f)

#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_12_15_POS (12)
#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_12_15_MASK (0xf)

#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_TICKTIMER_32K_ENABLE_POS (16)
#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_TICKTIMER_32K_ENABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU1_TICKTIMER_32K_ENABLE_POS (17)
#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU1_TICKTIMER_32K_ENABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_BIT_18_19_POS (18)
#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_BIT_18_19_MASK (0x3)

#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_20_24_POS (20)
#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_20_24_MASK (0x1f)

#define SYS_CPU_POWER_SLEEP_WAKEUP_BTS_SOFT_WAKEUP_REQ_POS (25)
#define SYS_CPU_POWER_SLEEP_WAKEUP_BTS_SOFT_WAKEUP_REQ_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_RD_DISABLE_POS (26)
#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_RD_DISABLE_MASK (0x1)

