bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_CPU_POWER_SLEEP_WAKEUP_OTP_RD_DISABLE_POS (27)
#define SYS_CPU_POWER_SLEEP_WAKEUP_OTP_RD_DISABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SHARE_MEM_CLKGATING_DISABLE_POS (28)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SHARE_MEM_CLKGATING_DISABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_29_31_POS (29)
#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_29_31_MASK (0x7)

#define SYS_CPU0_INT_0_31_EN_ADDR (SOC_SYS_REG_BASE + (0x14 << 2))

#define SYS_CPU0_INT_0_31_EN_CPU0_INTEN_POS (0)
#define SYS_CPU0_INT_0_31_EN_CPU0_INTEN_MASK (0xffffffff)

#define SYS_CPU0_INT_0_31_EN_CPU0_DMA0_NSEC_INT_EN_POS (0)
#define SYS_CPU0_INT_0_31_EN_CPU0_DMA0_NSEC_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_ENCP_SEC_INTR_INT_EN_POS (1)
#define SYS_CPU0_INT_0_31_EN_CPU0_ENCP_SEC_INTR_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_ENCP_NSEC_INTR_INT_EN_POS (2)
#define SYS_CPU0_INT_0_31_EN_CPU0_ENCP_NSEC_INTR_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_TIMER_INT_EN_POS (3)
#define SYS_CPU0_INT_0_31_EN_CPU0_TIMER_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_UART_INT_EN_POS (4)
#define SYS_CPU0_INT_0_31_EN_CPU0_UART_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_PWM0_INT_EN_POS (5)
#define SYS_CPU0_INT_0_31_EN_CPU0_PWM0_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_I2C0_INT_EN_POS (6)
#define SYS_CPU0_INT_0_31_EN_CPU0_I2C0_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_SPI0_INT_EN_POS (7)
#define SYS_CPU0_INT_0_31_EN_CPU0_SPI0_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_SADC_INT_EN_POS (8)
#define SYS_CPU0_INT_0_31_EN_CPU0_SADC_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_IRDA_INT_EN_POS (9)
#define SYS_CPU0_INT_0_31_EN_CPU0_IRDA_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_L2_SEC_INT_EN_POS (10)
#define SYS_CPU0_INT_0_31_EN_CPU0_L2_SEC_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_DMA0_SEC_INT_EN_POS (11)
#define SYS_CPU0_INT_0_31_EN_CPU0_DMA0_SEC_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_LA_INT_EN_POS (12)
#define SYS_CPU0_INT_0_31_EN_CPU0_LA_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_ACOMP0_INT_EN_POS (13)
#define SYS_CPU0_INT_0_31_EN_CPU0_ACOMP0_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_ACOMP1_INT_EN_POS (14)
#define SYS_CPU0_INT_0_31_EN_CPU0_ACOMP1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_UART1_INT_EN_POS (15)
#define SYS_CPU0_INT_0_31_EN_CPU0_UART1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_CPU0_FPU_INT_EN_POS (16)
#define SYS_CPU0_INT_0_31_EN_CPU0_CPU0_FPU_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_CPU1_FPU_INT_EN_POS (17)
#define SYS_CPU0_INT_0_31_EN_CPU0_CPU1_FPU_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_CAN_INT_EN_POS (18)
#define SYS_CPU0_INT_0_31_EN_CPU0_CAN_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_L2_NSEC_INT_EN_POS (19)
#define SYS_CPU0_INT_0_31_EN_CPU0_L2_NSEC_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_VID_DISP0_INT_EN_POS (20)
#define SYS_CPU0_INT_0_31_EN_CPU0_VID_DISP0_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_CKMN_INT_EN_POS (21)
#define SYS_CPU0_INT_0_31_EN_CPU0_CKMN_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_VID_DISP1_INT_EN_POS (22)
#define SYS_CPU0_INT_0_31_EN_CPU0_VID_DISP1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_AUD_INT_EN_POS (23)
#define SYS_CPU0_INT_0_31_EN_CPU0_AUD_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_I2S0_INT_EN_POS (24)
#define SYS_CPU0_INT_0_31_EN_CPU0_I2S0_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_I2S1_INT_EN_POS (25)
#define SYS_CPU0_INT_0_31_EN_CPU0_I2S1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_VID_DISP2_INT_EN_POS (26)
#define SYS_CPU0_INT_0_31_EN_CPU0_VID_DISP2_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_IPCHECKSUM_INT_EN_POS (27)
#define SYS_CPU0_INT_0_31_EN_CPU0_IPCHECKSUM_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_THREAD_INT_EN_POS (28)
#define SYS_CPU0_INT_0_31_EN_CPU0_THREAD_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_PHY_MBP_INT_EN_POS (29)
#define SYS_CPU0_INT_0_31_EN_CPU0_PHY_MBP_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_PHY_RIU_INT_EN_POS (30)
#define SYS_CPU0_INT_0_31_EN_CPU0_PHY_RIU_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_MAC_INT_TX_RX_TIMER_N_INT_EN_POS (31)
#define SYS_CPU0_INT_0_31_EN_CPU0_MAC_INT_TX_RX_TIMER_N_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_ADDR (SOC_SYS_REG_BASE + (0x15 << 2))

#define SYS_CPU0_INT_32_63_EN_CPU0_INTEN_POS (0)
#define SYS_CPU0_INT_32_63_EN_CPU0_INTEN_MASK (0xffffffff)

#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_TX_RX_MISC_N_INT_EN_POS (0)
#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_TX_RX_MISC_N_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_RX_TRIGGER_N_INT_EN_POS (1)
#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_RX_TRIGGER_N_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_TX_TRIGGER_N_INT_EN_POS (2)
#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_TX_TRIGGER_N_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_PORT_TRIGGER_N_INT_EN_POS (3)
#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_PORT_TRIGGER_N_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_GEN_N_INT_EN_POS (4)
#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_GEN_N_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_GPIO_NS_INT_EN_POS (5)
#define SYS_CPU0_INT_32_63_EN_CPU0_GPIO_NS_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_INT_MAC_WAKEUP_INT_EN_POS (6)
#define SYS_CPU0_INT_32_63_EN_CPU0_INT_MAC_WAKEUP_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_DM_IRQ_INT_EN_POS (7)
#define SYS_CPU0_INT_32_63_EN_CPU0_DM_IRQ_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_BLE_IRQ_INT_EN_POS (8)
#define SYS_CPU0_INT_32_63_EN_CPU0_BLE_IRQ_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_BT_IRQ_INT_EN_POS (9)
#define SYS_CPU0_INT_32_63_EN_CPU0_BT_IRQ_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_BTDM_WAKE_UP_INT_EN_POS (10)
#define SYS_CPU0_INT_32_63_EN_CPU0_BTDM_WAKE_UP_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_TOUCHED_INT_EN_POS (11)
#define SYS_CPU0_INT_32_63_EN_CPU0_TOUCHED_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_I2S2_INT_EN_POS (12)
#define SYS_CPU0_INT_32_63_EN_CPU0_I2S2_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_I2S3_INT_EN_POS (13)
#define SYS_CPU0_INT_32_63_EN_CPU0_I2S3_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_SPDIF0_INT_EN_POS (14)
#define SYS_CPU0_INT_32_63_EN_CPU0_SPDIF0_INT_EN_MASK (0x1)

