bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_CPU0_INT_32_63_EN_CPU0_CEC_INT_EN_POS (15)
#define SYS_CPU0_INT_32_63_EN_CPU0_CEC_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_XDAC0_INT_EN_POS (16)
#define SYS_CPU0_INT_32_63_EN_CPU0_XDAC0_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_XDAC1_INT_EN_POS (17)
#define SYS_CPU0_INT_32_63_EN_CPU0_XDAC1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_OTP_INT_EN_POS (18)
#define SYS_CPU0_INT_32_63_EN_CPU0_OTP_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_DPLL_UNLOCK_INT_EN_POS (19)
#define SYS_CPU0_INT_32_63_EN_CPU0_DPLL_UNLOCK_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_DCO_UNLOCK_INT_EN_POS (20)
#define SYS_CPU0_INT_32_63_EN_CPU0_DCO_UNLOCK_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_USBPLUG_INT_EN_POS (21)
#define SYS_CPU0_INT_32_63_EN_CPU0_USBPLUG_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_RTC_INT_EN_POS (22)
#define SYS_CPU0_INT_32_63_EN_CPU0_RTC_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_GPIO_S_INT_EN_POS (23)
#define SYS_CPU0_INT_32_63_EN_CPU0_GPIO_S_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_UART2_INT_EN_POS (24)
#define SYS_CPU0_INT_32_63_EN_CPU0_UART2_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_SPI1_INT_EN_POS (25)
#define SYS_CPU0_INT_32_63_EN_CPU0_SPI1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_TIMER1_INT_EN_POS (26)
#define SYS_CPU0_INT_32_63_EN_CPU0_TIMER1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_SPI3_INT_EN_POS (27)
#define SYS_CPU0_INT_32_63_EN_CPU0_SPI3_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_SCR_INT_EN_POS (28)
#define SYS_CPU0_INT_32_63_EN_CPU0_SCR_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_LIN_INT_EN_POS (29)
#define SYS_CPU0_INT_32_63_EN_CPU0_LIN_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_CAN1_INT_EN_POS (30)
#define SYS_CPU0_INT_32_63_EN_CPU0_CAN1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_TIMER2_INT_EN_POS (31)
#define SYS_CPU0_INT_32_63_EN_CPU0_TIMER2_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_ADDR (SOC_SYS_REG_BASE + (0x16 << 2))

#define SYS_CPU0_INT_64_95_EN_CPU0_INTEN_POS (0)
#define SYS_CPU0_INT_64_95_EN_CPU0_INTEN_MASK (0xffffffff)

#define SYS_CPU0_INT_64_95_EN_CPU0_TIMER3_INT_EN_POS (0)
#define SYS_CPU0_INT_64_95_EN_CPU0_TIMER3_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_UART3_INT_EN_POS (1)
#define SYS_CPU0_INT_64_95_EN_CPU0_UART3_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_SPI2_INT_EN_POS (2)
#define SYS_CPU0_INT_64_95_EN_CPU0_SPI2_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_UART4_INT_EN_POS (3)
#define SYS_CPU0_INT_64_95_EN_CPU0_UART4_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_I2C3_INT_EN_POS (4)
#define SYS_CPU0_INT_64_95_EN_CPU0_I2C3_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_HSPL_INT_EN_POS (5)
#define SYS_CPU0_INT_64_95_EN_CPU0_HSPL_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_BK24_INT_EN_POS (6)
#define SYS_CPU0_INT_64_95_EN_CPU0_BK24_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_IRDA1_INT_EN_POS (7)
#define SYS_CPU0_INT_64_95_EN_CPU0_IRDA1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_IRDA2_INT_EN_POS (8)
#define SYS_CPU0_INT_64_95_EN_CPU0_IRDA2_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_IRDA3_INT_EN_POS (9)
#define SYS_CPU0_INT_64_95_EN_CPU0_IRDA3_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_I3C_INT_EN_POS (10)
#define SYS_CPU0_INT_64_95_EN_CPU0_I3C_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_I2S4_INT_EN_POS (11)
#define SYS_CPU0_INT_64_95_EN_CPU0_I2S4_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_SPDIF1_INT_EN_POS (12)
#define SYS_CPU0_INT_64_95_EN_CPU0_SPDIF1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_INT_M55SUB_INT_EN_POS (13)
#define SYS_CPU0_INT_64_95_EN_CPU0_INT_M55SUB_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_MAILBOX_INT_EN_POS (14)
#define SYS_CPU0_INT_64_95_EN_CPU0_MAILBOX_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_IPI_INT_EN_POS (15)
#define SYS_CPU0_INT_64_95_EN_CPU0_IPI_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_VID_DISP3_INT_EN_POS (16)
#define SYS_CPU0_INT_64_95_EN_CPU0_VID_DISP3_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_VAD_INT_EN_POS (17)
#define SYS_CPU0_INT_64_95_EN_CPU0_VAD_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV82_INT_EN_POS (18)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV82_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV83_INT_EN_POS (19)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV83_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV84_INT_EN_POS (20)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV84_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV85_INT_EN_POS (21)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV85_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV86_INT_EN_POS (22)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV86_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV87_INT_EN_POS (23)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV87_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV88_INT_EN_POS (24)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV88_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV89_INT_EN_POS (25)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV89_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV90_INT_EN_POS (26)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV90_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV91_INT_EN_POS (27)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV91_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV92_INT_EN_POS (28)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV92_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV93_INT_EN_POS (29)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV93_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV94_INT_EN_POS (30)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV94_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_64_95_EN_CPU0_RESV95_INT_EN_POS (31)
#define SYS_CPU0_INT_64_95_EN_CPU0_RESV95_INT_EN_MASK (0x1)
#define SYS_CPU1_INT_0_31_EN_ADDR (SOC_SYS_REG_BASE + (0x17 << 2))

#define SYS_CPU1_INT_0_31_EN_CPU1_INTEN_POS (0)
#define SYS_CPU1_INT_0_31_EN_CPU1_INTEN_MASK (0xffffffff)

