bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_CPU1_INT_32_63_EN_ADDR (SOC_SYS_REG_BASE + (0x18 << 2))

#define SYS_CPU1_INT_32_63_EN_CPU1_INTEN_POS (0)
#define SYS_CPU1_INT_32_63_EN_CPU1_INTEN_MASK (0xffffffff)

#define SYS_CPU1_INT_64_95_EN_ADDR (SOC_SYS_REG_BASE + (0x19 << 2))

#define SYS_CPU1_INT_64_95_EN_CPU1_INTEN_POS (0)
#define SYS_CPU1_INT_64_95_EN_CPU1_INTEN_MASK (0xffffffff)

#define SYS_M55SUB_INT_0_31_EN_ADDR (SOC_SYS_REG_BASE + (0x1a << 2))

#define SYS_M55SUB_INT_0_31_EN_M55SUB_INTEN_POS (0)
#define SYS_M55SUB_INT_0_31_EN_M55SUB_INTEN_MASK (0xffffffff)

#define SYS_M55SUB_INT_32_63_EN_ADDR (SOC_SYS_REG_BASE + (0x1b << 2))

#define SYS_M55SUB_INT_32_63_EN_M55SUB_INTEN_POS (0)
#define SYS_M55SUB_INT_32_63_EN_M55SUB_INTEN_MASK (0xffffffff)

#define SYS_M55SUB_INT_64_95_EN_ADDR (SOC_SYS_REG_BASE + (0x1c << 2))

#define SYS_M55SUB_INT_64_95_EN_M55SUB_INTEN_POS (0)
#define SYS_M55SUB_INT_64_95_EN_M55SUB_INTEN_MASK (0x7fffffff)

#define SYS_M55SUB_INT_64_95_EN_M55SUB_WAKEUP_POS (31)
#define SYS_M55SUB_INT_64_95_EN_M55SUB_WAKEUP_MASK (0x1)

#define SYS_RESERVER_REG0X1E_ADDR (SOC_SYS_REG_BASE + (0x1e << 2))

#define SYS_RESERVER_REG0X1E_SPSH_CFG_POS (0)
#define SYS_RESERVER_REG0X1E_SPSH_CFG_MASK (0x3ff)

#define SYS_RESERVER_REG0X1E_SPBH_CFG_POS (10)
#define SYS_RESERVER_REG0X1E_SPBH_CFG_MASK (0x7ff)

#define SYS_RESERVER_REG0X1E_RESERVED_BIT_21_23_POS (21)
#define SYS_RESERVER_REG0X1E_RESERVED_BIT_21_23_MASK (0x7)

#define SYS_RESERVER_REG0X1E_SET_KEY_POS (24)
#define SYS_RESERVER_REG0X1E_SET_KEY_MASK (0xff)

#define SYS_RESERVER_REG0X1F_ADDR (SOC_SYS_REG_BASE + (0x1f << 2))

#define SYS_RESERVER_REG0X1F_STPH_CFG_POS (0)
#define SYS_RESERVER_REG0X1F_STPH_CFG_MASK (0xfff)

#define SYS_RESERVER_REG0X1F_RESERVED_BIT_12_23_POS (12)
#define SYS_RESERVER_REG0X1F_RESERVED_BIT_12_23_MASK (0xfff)

#define SYS_RESERVER_REG0X1F_SET_KEY_POS (24)
#define SYS_RESERVER_REG0X1F_SET_KEY_MASK (0xff)

#define SYS_CPU0_INT_0_31_STATUS_ADDR (SOC_SYS_REG_BASE + (0x20 << 2))

#define SYS_CPU0_INT_0_31_STATUS_INTS_STATUS0_POS (0)
#define SYS_CPU0_INT_0_31_STATUS_INTS_STATUS0_MASK (0xffffffff)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_DMA0_NSEC_INT_ST_POS (0)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_DMA0_NSEC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_ENCP_SEC_INTR_INT_ST_POS (1)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_ENCP_SEC_INTR_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_ENCP_NSEC_INTR_INT_ST_POS (2)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_ENCP_NSEC_INTR_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_TIMER_INT_ST_POS (3)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_TIMER_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART_INT_ST_POS (4)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_PWM0_INT_ST_POS (5)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_PWM0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2C0_INT_ST_POS (6)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2C0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_SPI0_INT_ST_POS (7)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_SPI0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_SADC_INT_ST_POS (8)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_SADC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_IRDA_INT_ST_POS (9)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_IRDA_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_L2_SEC_INT_ST_POS (10)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_L2_SEC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_DMA0_SEC_INT_ST_POS (11)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_DMA0_SEC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_LA_INT_ST_POS (12)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_LA_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_ACOMP0_INT_ST_POS (13)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_ACOMP0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_ACOMP1_INT_ST_POS (14)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_ACOMP1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART1_INT_ST_POS (15)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_CPU0_FPU_INT_ST_POS (16)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_CPU0_FPU_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_CPU1_FPU_INT_ST_POS (17)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_CPU1_FPU_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_CAN_INT_ST_POS (18)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_CAN_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_L2_NSEC_INT_ST_POS (19)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_L2_NSEC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_VID_DISP0_INT_ST_POS (20)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_VID_DISP0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_CKMN_INT_ST_POS (21)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_CKMN_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_VID_DISP1_INT_ST_POS (22)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_VID_DISP1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_AUD_INT_ST_POS (23)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_AUD_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2S0_INT_ST_POS (24)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2S0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2S1_INT_ST_POS (25)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2S1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_VID_DISP2_INT_ST_POS (26)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_VID_DISP2_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_IPCHECKSUM_INT_ST_POS (27)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_IPCHECKSUM_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_THREAD_INT_ST_POS (28)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_THREAD_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_PHY_MBP_INT_ST_POS (29)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_PHY_MBP_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_PHY_RIU_INT_ST_POS (30)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_PHY_RIU_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_MAC_INT_TX_RX_TIMER_N_INT_ST_POS (31)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_MAC_INT_TX_RX_TIMER_N_INT_ST_MASK (0x1)

