bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_CPU0_INT_32_63_STATUS_ADDR (SOC_SYS_REG_BASE + (0x21 << 2))

#define SYS_CPU0_INT_32_63_STATUS_INTS_STATUS1_POS (0)
#define SYS_CPU0_INT_32_63_STATUS_INTS_STATUS1_MASK (0xffffffff)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_TX_RX_MISC_N_INT_ST_POS (0)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_TX_RX_MISC_N_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_RX_TRIGGER_N_INT_ST_POS (1)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_RX_TRIGGER_N_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_TX_TRIGGER_N_INT_ST_POS (2)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_TX_TRIGGER_N_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_PORT_TRIGGER_N_INT_ST_POS (3)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_PORT_TRIGGER_N_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_GEN_N_INT_ST_POS (4)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_GEN_N_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_NS_INT_ST_POS (5)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_NS_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_INT_MAC_WAKEUP_INT_ST_POS (6)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_INT_MAC_WAKEUP_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_DM_IRQ_INT_ST_POS (7)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_DM_IRQ_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_BLE_IRQ_INT_ST_POS (8)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_BLE_IRQ_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_BT_IRQ_INT_ST_POS (9)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_BT_IRQ_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_BTDM_WAKE_UP_INT_ST_POS (10)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_BTDM_WAKE_UP_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_TOUCHED_INT_ST_POS (11)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_TOUCHED_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_I2S2_INT_ST_POS (12)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_I2S2_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_I2S3_INT_ST_POS (13)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_I2S3_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_SPDIF0_INT_ST_POS (14)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_SPDIF0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_CEC_INT_ST_POS (15)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_CEC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_XDAC0_INT_ST_POS (16)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_XDAC0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_XDAC1_INT_ST_POS (17)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_XDAC1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_OTP_INT_ST_POS (18)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_OTP_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_DPLL_UNLOCK_INT_ST_POS (19)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_DPLL_UNLOCK_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_DCO_UNLOCK_INT_ST_POS (20)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_DCO_UNLOCK_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_USBPLUG_INT_ST_POS (21)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_USBPLUG_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RTC_INT_ST_POS (22)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RTC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_S_INT_ST_POS (23)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_S_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_UART2_INT_ST_POS (24)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_UART2_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_SPI1_INT_ST_POS (25)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_SPI1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_TIMER1_INT_ST_POS (26)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_TIMER1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_SPI3_INT_ST_POS (27)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_SPI3_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_SCR_INT_ST_POS (28)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_SCR_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_LIN_INT_ST_POS (29)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_LIN_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_CAN1_INT_ST_POS (30)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_CAN1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_TIMER2_INT_ST_POS (31)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_TIMER2_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_ADDR (SOC_SYS_REG_BASE + (0x22 << 2))

#define SYS_CPU0_INT_64_95_STATUS_INTS_STATUS2_POS (0)
#define SYS_CPU0_INT_64_95_STATUS_INTS_STATUS2_MASK (0xffffffff)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_TIMER3_INT_ST_POS (0)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_TIMER3_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_UART3_INT_ST_POS (1)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_UART3_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_SPI2_INT_ST_POS (2)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_SPI2_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_UART4_INT_ST_POS (3)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_UART4_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_I2C3_INT_ST_POS (4)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_I2C3_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_HSPL_INT_ST_POS (5)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_HSPL_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_BK24_INT_ST_POS (6)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_BK24_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_IRDA1_INT_ST_POS (7)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_IRDA1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_IRDA2_INT_ST_POS (8)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_IRDA2_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_IRDA3_INT_ST_POS (9)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_IRDA3_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_I3C_INT_ST_POS (10)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_I3C_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_I2S4_INT_ST_POS (11)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_I2S4_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_SPDIF1_INT_ST_POS (12)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_SPDIF1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_INT_M55SUB_INT_ST_POS (13)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_INT_M55SUB_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_MAILBOX_INT_ST_POS (14)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_MAILBOX_INT_ST_MASK (0x1)

