bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_CPU0_INT_64_95_STATUS_CPU0_IPI_INT_ST_POS (15)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_IPI_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_VID_DISP3_INT_ST_POS (16)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_VID_DISP3_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_VAD_INT_ST_POS (17)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_VAD_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV82_INT_ST_POS (18)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV82_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV83_INT_ST_POS (19)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV83_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV84_INT_ST_POS (20)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV84_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV85_INT_ST_POS (21)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV85_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV86_INT_ST_POS (22)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV86_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV87_INT_ST_POS (23)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV87_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV88_INT_ST_POS (24)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV88_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV89_INT_ST_POS (25)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV89_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV90_INT_ST_POS (26)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV90_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV91_INT_ST_POS (27)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV91_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV92_INT_ST_POS (28)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV92_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV93_INT_ST_POS (29)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV93_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV94_INT_ST_POS (30)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV94_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV95_INT_ST_POS (31)
#define SYS_CPU0_INT_64_95_STATUS_CPU0_RESV95_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_ADDR (SOC_SYS_REG_BASE + (0x23 << 2))

#define SYS_CPU1_INT_0_31_STATUS_INTS_STATUS3_POS (0)
#define SYS_CPU1_INT_0_31_STATUS_INTS_STATUS3_MASK (0xffffffff)

#define SYS_CPU1_INT_32_63_STATUS_ADDR (SOC_SYS_REG_BASE + (0x24 << 2))

#define SYS_CPU1_INT_32_63_STATUS_INTS_STATUS4_POS (0)
#define SYS_CPU1_INT_32_63_STATUS_INTS_STATUS4_MASK (0xffffffff)

#define SYS_CPU1_INT_64_95_STATUS_ADDR (SOC_SYS_REG_BASE + (0x25 << 2))

#define SYS_CPU1_INT_64_95_STATUS_INTS_STATUS5_POS (0)
#define SYS_CPU1_INT_64_95_STATUS_INTS_STATUS5_MASK (0xffffffff)

#define SYS_M55SUB_INT_0_31_STATUS_ADDR (SOC_SYS_REG_BASE + (0x26 << 2))

#define SYS_M55SUB_INT_0_31_STATUS_M55SUB_STATUS0_POS (0)
#define SYS_M55SUB_INT_0_31_STATUS_M55SUB_STATUS0_MASK (0xffffffff)

#define SYS_M55SUB_INT_32_63_STATUS_ADDR (SOC_SYS_REG_BASE + (0x27 << 2))

#define SYS_M55SUB_INT_32_63_STATUS_M55SUB_STATUS1_POS (0)
#define SYS_M55SUB_INT_32_63_STATUS_M55SUB_STATUS1_MASK (0xffffffff)

#define SYS_M55SUB_INT_64_95_STATUS_ADDR (SOC_SYS_REG_BASE + (0x28 << 2))

#define SYS_M55SUB_INT_64_95_STATUS_M55SUB_STATUS2_POS (0)
#define SYS_M55SUB_INT_64_95_STATUS_M55SUB_STATUS2_MASK (0xffffffff)

#define SYS_RESERVER_REG0X2A_ADDR (SOC_SYS_REG_BASE + (0x2a << 2))

#define SYS_RESERVER_REG0X2A_DEBUG_GPIO_IE_POS (0)
#define SYS_RESERVER_REG0X2A_DEBUG_GPIO_IE_MASK (0xffffffff)

#define SYS_RESERVER_REG0X2B_ADDR (SOC_SYS_REG_BASE + (0x2b << 2))

#define SYS_RESERVER_REG0X2B_DEBUG_GPIO_I_POS (0)
#define SYS_RESERVER_REG0X2B_DEBUG_GPIO_I_MASK (0xffffffff)

#define SYS_RESERVER_REG0X2C_ADDR (SOC_SYS_REG_BASE + (0x2c << 2))

#define SYS_RESERVER_REG0X2C_CACHE_CLEAN_MODE_POS (0)
#define SYS_RESERVER_REG0X2C_CACHE_CLEAN_MODE_MASK (0x1)

#define SYS_RESERVER_REG0X2C_CPU0_ICACHE_CLEAN_MODE_POS (1)
#define SYS_RESERVER_REG0X2C_CPU0_ICACHE_CLEAN_MODE_MASK (0x1)

#define SYS_RESERVER_REG0X2C_CPU0_ICACHE_CLEAN_TAG_SEL_POS (2)
#define SYS_RESERVER_REG0X2C_CPU0_ICACHE_CLEAN_TAG_SEL_MASK (0x1)

#define SYS_RESERVER_REG0X2C_L2_CACHE_CLEAN_MODE_POS (3)
#define SYS_RESERVER_REG0X2C_L2_CACHE_CLEAN_MODE_MASK (0x1)

#define SYS_RESERVER_REG0X2C_L2_CACHE_CLEAN_TAG_SEL_POS (4)
#define SYS_RESERVER_REG0X2C_L2_CACHE_CLEAN_TAG_SEL_MASK (0x3)

#define SYS_RESERVER_REG0X2C_RESERVED_6_23_POS (6)
#define SYS_RESERVER_REG0X2C_RESERVED_6_23_MASK (0x3ffff)

#define SYS_RESERVER_REG0X2C_SET_KEY_POS (24)
#define SYS_RESERVER_REG0X2C_SET_KEY_MASK (0xff)

#define SYS_RESERVER_REG0X2E_ADDR (SOC_SYS_REG_BASE + (0x2e << 2))

#define SYS_RESERVER_REG0X2E_SPSL_CFG_POS (0)
#define SYS_RESERVER_REG0X2E_SPSL_CFG_MASK (0x3ff)

#define SYS_RESERVER_REG0X2E_SPBL_CFG_POS (10)
#define SYS_RESERVER_REG0X2E_SPBL_CFG_MASK (0x7ff)

#define SYS_RESERVER_REG0X2E_RESERVED_BIT_21_23_POS (21)
#define SYS_RESERVER_REG0X2E_RESERVED_BIT_21_23_MASK (0x7)

#define SYS_RESERVER_REG0X2E_SET_KEY_POS (24)
#define SYS_RESERVER_REG0X2E_SET_KEY_MASK (0xff)

#define SYS_RESERVER_REG0X2F_ADDR (SOC_SYS_REG_BASE + (0x2f << 2))

#define SYS_RESERVER_REG0X2F_STPL_CFG_POS (0)
#define SYS_RESERVER_REG0X2F_STPL_CFG_MASK (0xfff)

#define SYS_RESERVER_REG0X2F_RESERVED_BIT_12_23_POS (12)
#define SYS_RESERVER_REG0X2F_RESERVED_BIT_12_23_MASK (0xfff)

#define SYS_RESERVER_REG0X2F_SET_KEY_POS (24)
#define SYS_RESERVER_REG0X2F_SET_KEY_MASK (0xff)

#define SYS_GPIO_INPUT_STATUS0_ADDR (SOC_SYS_REG_BASE + (0x30 << 2))

#define SYS_GPIO_INPUT_STATUS0_GPIO_INPUT_STATUS0_POS (0)
#define SYS_GPIO_INPUT_STATUS0_GPIO_INPUT_STATUS0_MASK (0xffffffff)

#define SYS_GPIO_INPUT_STATUS1_ADDR (SOC_SYS_REG_BASE + (0x31 << 2))

#define SYS_GPIO_INPUT_STATUS1_GPIO_INPUT_STATUS1_POS (0)
#define SYS_GPIO_INPUT_STATUS1_GPIO_INPUT_STATUS1_MASK (0xffffffff)

#define SYS_GPIO_INPUT_STATUS2_ADDR (SOC_SYS_REG_BASE + (0x32 << 2))

