bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_GPIO_INPUT_STATUS2_GPIO_INPUT_STATUS2_POS (0)
#define SYS_GPIO_INPUT_STATUS2_GPIO_INPUT_STATUS2_MASK (0xff)

#define SYS_GPIO_INPUT_STATUS2_RESERVED_BIT_8_30_POS (8)
#define SYS_GPIO_INPUT_STATUS2_RESERVED_BIT_8_30_MASK (0x7fffff)

#define SYS_GPIO_INPUT_STATUS2_GPIO_INPUT_STATUS_EN_POS (31)
#define SYS_GPIO_INPUT_STATUS2_GPIO_INPUT_STATUS_EN_MASK (0x1)

#define SYS_RESERVER_REG0X33_ADDR (SOC_SYS_REG_BASE + (0x33 << 2))

#define SYS_RESERVER_REG0X33_ACOMP0_PWM0_SAMPLE_EN_POS (0)
#define SYS_RESERVER_REG0X33_ACOMP0_PWM0_SAMPLE_EN_MASK (0x1)

#define SYS_RESERVER_REG0X33_ACOMP1_PWM0_SAMPLE_EN_POS (1)
#define SYS_RESERVER_REG0X33_ACOMP1_PWM0_SAMPLE_EN_MASK (0x1)

#define SYS_RESERVER_REG0X33_RESERVED_2_15_POS (2)
#define SYS_RESERVER_REG0X33_RESERVED_2_15_MASK (0x3fff)

#define SYS_RESERVER_REG0X33_L2_DIS_PWR_DOWN_MAINT_POS (16)
#define SYS_RESERVER_REG0X33_L2_DIS_PWR_DOWN_MAINT_MASK (0x1)

#define SYS_RESERVER_REG0X33_L2_APB_VIOLATION_RESP_POS (17)
#define SYS_RESERVER_REG0X33_L2_APB_VIOLATION_RESP_MASK (0x1)

#define SYS_RESERVER_REG0X33_CPU0_DBGEN_L2_RST_DIS_POS (18)
#define SYS_RESERVER_REG0X33_CPU0_DBGEN_L2_RST_DIS_MASK (0x1)

#define SYS_RESERVER_REG0X33_CPU1_DBGEN_L2_RST_DIS_POS (19)
#define SYS_RESERVER_REG0X33_CPU1_DBGEN_L2_RST_DIS_MASK (0x1)

#define SYS_RESERVER_REG0X33_RESERVED_20_23_POS (20)
#define SYS_RESERVER_REG0X33_RESERVED_20_23_MASK (0xf)

#define SYS_RESERVER_REG0X33_CPU0_WFE_SRC_POS (24)
#define SYS_RESERVER_REG0X33_CPU0_WFE_SRC_MASK (0x1)

#define SYS_RESERVER_REG0X33_CPU0_WFE_PULSE_POS (25)
#define SYS_RESERVER_REG0X33_CPU0_WFE_PULSE_MASK (0x1)

#define SYS_RESERVER_REG0X33_CPU1_WFE_SRC_POS (26)
#define SYS_RESERVER_REG0X33_CPU1_WFE_SRC_MASK (0x1)

#define SYS_RESERVER_REG0X33_CPU1_WFE_PULSE_POS (27)
#define SYS_RESERVER_REG0X33_CPU1_WFE_PULSE_MASK (0x1)

#define SYS_RESERVER_REG0X33_CPU0_SLEEPING_STATE_POS (28)
#define SYS_RESERVER_REG0X33_CPU0_SLEEPING_STATE_MASK (0x1)

#define SYS_RESERVER_REG0X33_CPU0_DEEPSLEEP_STATE_POS (29)
#define SYS_RESERVER_REG0X33_CPU0_DEEPSLEEP_STATE_MASK (0x1)

#define SYS_RESERVER_REG0X33_CPU1_SLEEPING_STATE_POS (30)
#define SYS_RESERVER_REG0X33_CPU1_SLEEPING_STATE_MASK (0x1)

#define SYS_RESERVER_REG0X33_CPU1_DEEPSLEEP_STATE_POS (31)
#define SYS_RESERVER_REG0X33_CPU1_DEEPSLEEP_STATE_MASK (0x1)

#define SYS_CPU0_CURPC_ADDR (SOC_SYS_REG_BASE + (0x34 << 2))

#define SYS_CPU0_CURPC_CPU0_CURPC_POS (0)
#define SYS_CPU0_CURPC_CPU0_CURPC_MASK (0xffffffff)

#define SYS_CPU0_FAULTSTAT_H_ADDR (SOC_SYS_REG_BASE + (0x35 << 2))

#define SYS_CPU0_FAULTSTAT_H_CPU0_FAULTSTAT_H_POS (0)
#define SYS_CPU0_FAULTSTAT_H_CPU0_FAULTSTAT_H_MASK (0x7ff)

#define SYS_CPU0_FAULTSTAT_H_RESERVED_11_31_POS (11)
#define SYS_CPU0_FAULTSTAT_H_RESERVED_11_31_MASK (0x1fffff)

#define SYS_CPU0_FAULTSTAT_L_ADDR (SOC_SYS_REG_BASE + (0x36 << 2))

#define SYS_CPU0_FAULTSTAT_L_CPU0_FAULTSTAT_L_POS (0)
#define SYS_CPU0_FAULTSTAT_L_CPU0_FAULTSTAT_L_MASK (0xffffffff)

#define SYS_CPU0_INFO_ADDR (SOC_SYS_REG_BASE + (0x37 << 2))

#define SYS_CPU0_INFO_CPU0_INTNUM_POS (0)
#define SYS_CPU0_INFO_CPU0_INTNUM_MASK (0x1ff)

#define SYS_CPU0_INFO_CPU0_CURRPRI_POS (9)
#define SYS_CPU0_INFO_CPU0_CURRPRI_MASK (0xff)

#define SYS_CPU0_INFO_CPU0_CURRNS_POS (17)
#define SYS_CPU0_INFO_CPU0_CURRNS_MASK (0x1)

#define SYS_CPU0_INFO_CPU0_HALTED_POS (18)
#define SYS_CPU0_INFO_CPU0_HALTED_MASK (0x1)

#define SYS_CPU0_INFO_CPU0_NC_HREADY_POS (19)
#define SYS_CPU0_INFO_CPU0_NC_HREADY_MASK (0x1)

#define SYS_CPU0_INFO_CPU_CACHE_M_HREADY_POS (20)
#define SYS_CPU0_INFO_CPU_CACHE_M_HREADY_MASK (0x1)

#define SYS_CPU0_INFO_CPU0_RESETN_POS (21)
#define SYS_CPU0_INFO_CPU0_RESETN_MASK (0x1)

#define SYS_CPU0_INFO_RESERVED_22_31_POS (22)
#define SYS_CPU0_INFO_RESERVED_22_31_MASK (0x3ff)

#define SYS_SYS_DEBUG_CONFIG0_ADDR (SOC_SYS_REG_BASE + (0x38 << 2))

#define SYS_SYS_DEBUG_CONFIG0_DBUG_CONFIG0_POS (0)
#define SYS_SYS_DEBUG_CONFIG0_DBUG_CONFIG0_MASK (0xffffffff)

#define SYS_SYS_DEBUG_CONFIG1_ADDR (SOC_SYS_REG_BASE + (0x39 << 2))

#define SYS_SYS_DEBUG_CONFIG1_DBUG_CFG1_POS (0)
#define SYS_SYS_DEBUG_CONFIG1_DBUG_CFG1_MASK (0x1f)

#define SYS_SYS_DEBUG_CONFIG1_RESERVED_BIT_5_31_POS (5)
#define SYS_SYS_DEBUG_CONFIG1_RESERVED_BIT_5_31_MASK (0x7ffffff)

#define SYS_ANAREG_STAT_ADDR (SOC_SYS_REG_BASE + (0x3a << 2))

#define SYS_ANAREG_STAT_ANAREG_STAT_POS (0)
#define SYS_ANAREG_STAT_ANAREG_STAT_MASK (0xffffffff)

#define SYS_RESERVER_REG0X3B_ADDR (SOC_SYS_REG_BASE + (0x3b << 2))

#define SYS_RESERVER_REG0X3B_CORESIGHT_CHN_GATE_EN_POS (0)
#define SYS_RESERVER_REG0X3B_CORESIGHT_CHN_GATE_EN_MASK (0xffffff)

#define SYS_RESERVER_REG0X3B_CORESIGHT_TPMAXDATASIZE_POS (24)
#define SYS_RESERVER_REG0X3B_CORESIGHT_TPMAXDATASIZE_MASK (0x1f)

#define SYS_RESERVER_REG0X3B_CORESIGHT_VALID_POS (29)
#define SYS_RESERVER_REG0X3B_CORESIGHT_VALID_MASK (0x1)

#define SYS_RESERVER_REG0X3B_RESERVED_30_30_POS (30)
#define SYS_RESERVER_REG0X3B_RESERVED_30_30_MASK (0x1)

#define SYS_RESERVER_REG0X3B_ANAREGB_STAT_POS (31)
#define SYS_RESERVER_REG0X3B_ANAREGB_STAT_MASK (0x1)

#define SYS_CPU1_CURPC_ADDR (SOC_SYS_REG_BASE + (0x3c << 2))

#define SYS_CPU1_CURPC_CPU1_CURPC_POS (0)
#define SYS_CPU1_CURPC_CPU1_CURPC_MASK (0xffffffff)

#define SYS_CPU1_FAULTSTAT_H_ADDR (SOC_SYS_REG_BASE + (0x3d << 2))

#define SYS_CPU1_FAULTSTAT_H_CPU1_FAULTSTAT_H_POS (0)
#define SYS_CPU1_FAULTSTAT_H_CPU1_FAULTSTAT_H_MASK (0x7ff)

#define SYS_CPU1_FAULTSTAT_H_RESERVED_11_31_POS (11)
#define SYS_CPU1_FAULTSTAT_H_RESERVED_11_31_MASK (0x1fffff)

#define SYS_CPU1_FAULTSTAT_L_ADDR (SOC_SYS_REG_BASE + (0x3e << 2))

#define SYS_CPU1_FAULTSTAT_L_CPU1_FAULTSTAT_L_POS (0)
#define SYS_CPU1_FAULTSTAT_L_CPU1_FAULTSTAT_L_MASK (0xffffffff)

#define SYS_CPU1_INFO_ADDR (SOC_SYS_REG_BASE + (0x3f << 2))

#define SYS_CPU1_INFO_CPU1_INTNUM_POS (0)
#define SYS_CPU1_INFO_CPU1_INTNUM_MASK (0x1ff)

#define SYS_CPU1_INFO_CPU1_CURRPRI_POS (9)
#define SYS_CPU1_INFO_CPU1_CURRPRI_MASK (0xff)

#define SYS_CPU1_INFO_CPU1_CURRNS_POS (17)
#define SYS_CPU1_INFO_CPU1_CURRNS_MASK (0x1)

#define SYS_CPU1_INFO_CPU1_HALTED_POS (18)
#define SYS_CPU1_INFO_CPU1_HALTED_MASK (0x1)

#define SYS_CPU1_INFO_CPU1_NC_HREADY_POS (19)
#define SYS_CPU1_INFO_CPU1_NC_HREADY_MASK (0x1)

#define SYS_CPU1_INFO_RESERVED_20_20_POS (20)
#define SYS_CPU1_INFO_RESERVED_20_20_MASK (0x1)

#define SYS_CPU1_INFO_CPU1_RESETN_POS (21)
#define SYS_CPU1_INFO_CPU1_RESETN_MASK (0x1)

#define SYS_CPU1_INFO_RESERVED_22_31_POS (22)
#define SYS_CPU1_INFO_RESERVED_22_31_MASK (0x3ff)

