bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_ANA_REG0_ADDR (SOC_SYS_REG_BASE + (0x40 << 2))

#define SYS_ANA_REG0_DPLL_TSTEN_POS (0)
#define SYS_ANA_REG0_DPLL_TSTEN_MASK (0x1)

#define SYS_ANA_REG0_CP_POS (1)
#define SYS_ANA_REG0_CP_MASK (0x7)

#define SYS_ANA_REG0_SPIDETEN_POS (4)
#define SYS_ANA_REG0_SPIDETEN_MASK (0x1)

#define SYS_ANA_REG0_HVREF_POS (5)
#define SYS_ANA_REG0_HVREF_MASK (0x3)

#define SYS_ANA_REG0_LVREF_POS (7)
#define SYS_ANA_REG0_LVREF_MASK (0x3)

#define SYS_ANA_REG0_RZCTRL26M_POS (9)
#define SYS_ANA_REG0_RZCTRL26M_MASK (0x1)

#define SYS_ANA_REG0_LOOPRZCTRL_POS (10)
#define SYS_ANA_REG0_LOOPRZCTRL_MASK (0xf)

#define SYS_ANA_REG0_RPC_POS (14)
#define SYS_ANA_REG0_RPC_MASK (0x3)

#define SYS_ANA_REG0_OPENLOOP_EN_POS (16)
#define SYS_ANA_REG0_OPENLOOP_EN_MASK (0x1)

#define SYS_ANA_REG0_UNLOCK_SEL_POS (17)
#define SYS_ANA_REG0_UNLOCK_SEL_MASK (0x1)

#define SYS_ANA_REG0_RST_UNLOCK_POS (18)
#define SYS_ANA_REG0_RST_UNLOCK_MASK (0x1)

#define SYS_ANA_REG0_SPITRIG_POS (19)
#define SYS_ANA_REG0_SPITRIG_MASK (0x1)

#define SYS_ANA_REG0_BAND_POS (20)
#define SYS_ANA_REG0_BAND_MASK (0x1)

#define SYS_ANA_REG0_BAND_1_POS (21)
#define SYS_ANA_REG0_BAND_1_MASK (0x1)

#define SYS_ANA_REG0_BAND_2_POS (22)
#define SYS_ANA_REG0_BAND_2_MASK (0x7)

#define SYS_ANA_REG0_BANDMANUAL_POS (25)
#define SYS_ANA_REG0_BANDMANUAL_MASK (0x1)

#define SYS_ANA_REG0_DSPTRIG_POS (26)
#define SYS_ANA_REG0_DSPTRIG_MASK (0x1)

#define SYS_ANA_REG0_LPEN_DPLL_POS (27)
#define SYS_ANA_REG0_LPEN_DPLL_MASK (0x1)

#define SYS_ANA_REG0_CKSEL_POS (28)
#define SYS_ANA_REG0_CKSEL_MASK (0x3)

#define SYS_ANA_REG0_BP_CALDONE_POS (30)
#define SYS_ANA_REG0_BP_CALDONE_MASK (0x1)

#define SYS_ANA_REG0_VSELLDO_POS (31)
#define SYS_ANA_REG0_VSELLDO_MASK (0x1)

#define SYS_ANA_REG1_ADDR (SOC_SYS_REG_BASE + (0x41 << 2))

#define SYS_ANA_REG1_VCOOFFSET_POS (0)
#define SYS_ANA_REG1_VCOOFFSET_MASK (0x1)

#define SYS_ANA_REG1_SELPOL_POS (1)
#define SYS_ANA_REG1_SELPOL_MASK (0x1)

#define SYS_ANA_REG1_DLYSEL_POS (2)
#define SYS_ANA_REG1_DLYSEL_MASK (0x3)

#define SYS_ANA_REG1_EDGESEL_NCK_POS (4)
#define SYS_ANA_REG1_EDGESEL_NCK_MASK (0x1)

#define SYS_ANA_REG1_NLOAD_DLYEN_POS (5)
#define SYS_ANA_REG1_NLOAD_DLYEN_MASK (0x1)

#define SYS_ANA_REG1_CP_POS (6)
#define SYS_ANA_REG1_CP_MASK (0x7)

#define SYS_ANA_REG1_SPIDETEN_POS (9)
#define SYS_ANA_REG1_SPIDETEN_MASK (0x1)

#define SYS_ANA_REG1_CBEN_POS (10)
#define SYS_ANA_REG1_CBEN_MASK (0x1)

#define SYS_ANA_REG1_HVREF_POS (11)
#define SYS_ANA_REG1_HVREF_MASK (0x3)

#define SYS_ANA_REG1_LVREF_POS (13)
#define SYS_ANA_REG1_LVREF_MASK (0x3)

#define SYS_ANA_REG1_RZCTRL26M_POS (15)
#define SYS_ANA_REG1_RZCTRL26M_MASK (0x1)

#define SYS_ANA_REG1_LPFRZ_POS (16)
#define SYS_ANA_REG1_LPFRZ_MASK (0xf)

#define SYS_ANA_REG1_RPC_POS (20)
#define SYS_ANA_REG1_RPC_MASK (0x7)

#define SYS_ANA_REG1_DPLL_TSTEN_POS (23)
#define SYS_ANA_REG1_DPLL_TSTEN_MASK (0x1)

#define SYS_ANA_REG1_KCTRL_POS (24)
#define SYS_ANA_REG1_KCTRL_MASK (0x3)

#define SYS_ANA_REG1_VSEL_LDO_POS (26)
#define SYS_ANA_REG1_VSEL_LDO_MASK (0x3)

#define SYS_ANA_REG1_DIV_SW_POS (28)
#define SYS_ANA_REG1_DIV_SW_MASK (0x1)

#define SYS_ANA_REG1_BP_CALDONE_POS (29)
#define SYS_ANA_REG1_BP_CALDONE_MASK (0x1)

#define SYS_ANA_REG1_CK2XEN_POS (30)
#define SYS_ANA_REG1_CK2XEN_MASK (0x1)

#define SYS_ANA_REG1_INT_MOD_POS (31)
#define SYS_ANA_REG1_INT_MOD_MASK (0x1)

#define SYS_ANA_REG2_ADDR (SOC_SYS_REG_BASE + (0x42 << 2))

#define SYS_ANA_REG2_NC_0_1_POS (0)
#define SYS_ANA_REG2_NC_0_1_MASK (0x3)

#define SYS_ANA_REG2_VCTRL_VSEL_POS (2)
#define SYS_ANA_REG2_VCTRL_VSEL_MASK (0x7)

#define SYS_ANA_REG2_NC_5_7_POS (5)
#define SYS_ANA_REG2_NC_5_7_MASK (0x7)

#define SYS_ANA_REG2_CK_TST_EN_POS (8)
#define SYS_ANA_REG2_CK_TST_EN_MASK (0x1)

#define SYS_ANA_REG2_CKTST_SEL_POS (9)
#define SYS_ANA_REG2_CKTST_SEL_MASK (0x3)

#define SYS_ANA_REG2_DCO_MODECAL_POS (11)
#define SYS_ANA_REG2_DCO_MODECAL_MASK (0x1)

#define SYS_ANA_REG2_DCO_MODECAL_1_POS (12)
#define SYS_ANA_REG2_DCO_MODECAL_1_MASK (0x1)

#define SYS_ANA_REG2_ANABUFSEL_RX_POS (13)
#define SYS_ANA_REG2_ANABUFSEL_RX_MASK (0x1)

#define SYS_ANA_REG2_NC_14_15_POS (14)
#define SYS_ANA_REG2_NC_14_15_MASK (0x3)

#define SYS_ANA_REG2_CKTDINVEN_POS (16)
#define SYS_ANA_REG2_CKTDINVEN_MASK (0x1)

#define SYS_ANA_REG2_CKTDEN_POS (17)
#define SYS_ANA_REG2_CKTDEN_MASK (0x1)

#define SYS_ANA_REG2_NC_18_20_POS (18)
#define SYS_ANA_REG2_NC_18_20_MASK (0x7)

#define SYS_ANA_REG2_XTAL32K_DGLITEN_POS (21)
#define SYS_ANA_REG2_XTAL32K_DGLITEN_MASK (0x1)

#define SYS_ANA_REG2_XTAL32K_DIVEN_POS (22)
#define SYS_ANA_REG2_XTAL32K_DIVEN_MASK (0x1)

#define SYS_ANA_REG2_RC32K_DGLITEN_POS (23)
#define SYS_ANA_REG2_RC32K_DGLITEN_MASK (0x1)

#define SYS_ANA_REG2_RC32K_DIVEN_POS (24)
#define SYS_ANA_REG2_RC32K_DIVEN_MASK (0x1)

#define SYS_ANA_REG2_NC_25_27_POS (25)
#define SYS_ANA_REG2_NC_25_27_MASK (0x7)

#define SYS_ANA_REG2_UNLOCK_SEL_DCO_POS (28)
#define SYS_ANA_REG2_UNLOCK_SEL_DCO_MASK (0x1)

#define SYS_ANA_REG2_RST_UNLOCK_DCO_POS (29)
#define SYS_ANA_REG2_RST_UNLOCK_DCO_MASK (0x1)

#define SYS_ANA_REG2_REFSAMEN_POS (30)
#define SYS_ANA_REG2_REFSAMEN_MASK (0x1)

#define SYS_ANA_REG2_ADCDCSEL_POS (31)
#define SYS_ANA_REG2_ADCDCSEL_MASK (0x1)

#define SYS_ANA_REG3_ADDR (SOC_SYS_REG_BASE + (0x43 << 2))

#define SYS_ANA_REG3_CTUNE_POS (0)
#define SYS_ANA_REG3_CTUNE_MASK (0xff)

#define SYS_ANA_REG3_CORE_HPEN_POS (8)
#define SYS_ANA_REG3_CORE_HPEN_MASK (0x1)

#define SYS_ANA_REG3_CK_SEL_POS (9)
#define SYS_ANA_REG3_CK_SEL_MASK (0x1)

#define SYS_ANA_REG3_ANABUF_SEL_TX_POS (10)
#define SYS_ANA_REG3_ANABUF_SEL_TX_MASK (0x1)

#define SYS_ANA_REG3_PWD_XTALLDO_POS (11)
#define SYS_ANA_REG3_PWD_XTALLDO_MASK (0x1)

#define SYS_ANA_REG3_IAMP_POS (12)
#define SYS_ANA_REG3_IAMP_MASK (0x1)

#define SYS_ANA_REG3_VDDREN_POS (13)
#define SYS_ANA_REG3_VDDREN_MASK (0x1)

