bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_ANA_REG3_XAMP_POS (14)
#define SYS_ANA_REG3_XAMP_MASK (0x3f)

#define SYS_ANA_REG3_VOSEL_POS (20)
#define SYS_ANA_REG3_VOSEL_MASK (0x1f)

#define SYS_ANA_REG3_EN_XTALH_SLEEP_POS (25)
#define SYS_ANA_REG3_EN_XTALH_SLEEP_MASK (0x1)

#define SYS_ANA_REG3_XTAL40_EN_POS (26)
#define SYS_ANA_REG3_XTAL40_EN_MASK (0x1)

#define SYS_ANA_REG3_BUFICTRL_POS (27)
#define SYS_ANA_REG3_BUFICTRL_MASK (0x1)

#define SYS_ANA_REG3_IBIAS_CTRL_POS (28)
#define SYS_ANA_REG3_IBIAS_CTRL_MASK (0x3)

#define SYS_ANA_REG3_ICORE_CTRL_POS (30)
#define SYS_ANA_REG3_ICORE_CTRL_MASK (0x3)

#define SYS_ANA_REG4_ADDR (SOC_SYS_REG_BASE + (0x44 << 2))

#define SYS_ANA_REG4_NC_0_31_POS (0)
#define SYS_ANA_REG4_NC_0_31_MASK (0xffffffff)

#define SYS_ANA_REG5_ADDR (SOC_SYS_REG_BASE + (0x45 << 2))

#define SYS_ANA_REG5_VSELLDO1_DPLL_POS (0)
#define SYS_ANA_REG5_VSELLDO1_DPLL_MASK (0x1)

#define SYS_ANA_REG5_EN_XTALL_POS (1)
#define SYS_ANA_REG5_EN_XTALL_MASK (0x1)

#define SYS_ANA_REG5_EN_DCO_POS (2)
#define SYS_ANA_REG5_EN_DCO_MASK (0x1)

#define SYS_ANA_REG5_TEMP_GSEL_POS (3)
#define SYS_ANA_REG5_TEMP_GSEL_MASK (0x1)

#define SYS_ANA_REG5_EN_TEMP_POS (4)
#define SYS_ANA_REG5_EN_TEMP_MASK (0x1)

#define SYS_ANA_REG5_EN_DPLL_POS (5)
#define SYS_ANA_REG5_EN_DPLL_MASK (0x1)

#define SYS_ANA_REG5_EN_CB_POS (6)
#define SYS_ANA_REG5_EN_CB_MASK (0x1)

#define SYS_ANA_REG5_GPIO_LATCH_POS (7)
#define SYS_ANA_REG5_GPIO_LATCH_MASK (0x1)

#define SYS_ANA_REG5_BYPASSEN_POS (8)
#define SYS_ANA_REG5_BYPASSEN_MASK (0x1)

#define SYS_ANA_REG5_NC_9_9_POS (9)
#define SYS_ANA_REG5_NC_9_9_MASK (0x1)

#define SYS_ANA_REG5_RC32K_REFCLK_EN_POS (10)
#define SYS_ANA_REG5_RC32K_REFCLK_EN_MASK (0x1)

#define SYS_ANA_REG5_SPILATCHB_RC32K_POS (11)
#define SYS_ANA_REG5_SPILATCHB_RC32K_MASK (0x1)

#define SYS_ANA_REG5_ROSC_DISABLE_POS (12)
#define SYS_ANA_REG5_ROSC_DISABLE_MASK (0x1)

#define SYS_ANA_REG5_PWDAUDPLL_POS (13)
#define SYS_ANA_REG5_PWDAUDPLL_MASK (0x1)

#define SYS_ANA_REG5_PWD_ROSC_SPI_POS (14)
#define SYS_ANA_REG5_PWD_ROSC_SPI_MASK (0x1)

#define SYS_ANA_REG5_NC_15_15_POS (15)
#define SYS_ANA_REG5_NC_15_15_MASK (0x1)

#define SYS_ANA_REG5_ITUNE_XTALL_POS (16)
#define SYS_ANA_REG5_ITUNE_XTALL_MASK (0xf)

#define SYS_ANA_REG5_XTALL_TSTEN_POS (20)
#define SYS_ANA_REG5_XTALL_TSTEN_MASK (0x1)

#define SYS_ANA_REG5_ROSC_TEN_POS (21)
#define SYS_ANA_REG5_ROSC_TEN_MASK (0x1)

#define SYS_ANA_REG5_BCAL_START_POS (22)
#define SYS_ANA_REG5_BCAL_START_MASK (0x1)

#define SYS_ANA_REG5_BCAL_EN_POS (23)
#define SYS_ANA_REG5_BCAL_EN_MASK (0x1)

#define SYS_ANA_REG5_BCAL_SEL_POS (24)
#define SYS_ANA_REG5_BCAL_SEL_MASK (0x7)

#define SYS_ANA_REG5_VBIAS_POS (27)
#define SYS_ANA_REG5_VBIAS_MASK (0x1f)

#define SYS_ANA_REG6_ADDR (SOC_SYS_REG_BASE + (0x46 << 2))

#define SYS_ANA_REG6_CALIB_INTERVAL_POS (0)
#define SYS_ANA_REG6_CALIB_INTERVAL_MASK (0x3ff)

#define SYS_ANA_REG6_MODIFY_INTERVAL_POS (10)
#define SYS_ANA_REG6_MODIFY_INTERVAL_MASK (0x3f)

#define SYS_ANA_REG6_XTAL_WAKEUP_TIME_POS (16)
#define SYS_ANA_REG6_XTAL_WAKEUP_TIME_MASK (0xf)

#define SYS_ANA_REG6_SPI_TRIG_POS (20)
#define SYS_ANA_REG6_SPI_TRIG_MASK (0x1)

#define SYS_ANA_REG6_MODIFI_AUTO_POS (21)
#define SYS_ANA_REG6_MODIFI_AUTO_MASK (0x1)

#define SYS_ANA_REG6_CALIB_AUTO_POS (22)
#define SYS_ANA_REG6_CALIB_AUTO_MASK (0x1)

#define SYS_ANA_REG6_CAL_MODE_POS (23)
#define SYS_ANA_REG6_CAL_MODE_MASK (0x1)

#define SYS_ANA_REG6_MANU_ENA_POS (24)
#define SYS_ANA_REG6_MANU_ENA_MASK (0x1)

#define SYS_ANA_REG6_MANU_CIN_POS (25)
#define SYS_ANA_REG6_MANU_CIN_MASK (0x7f)

#define SYS_ANA_REG7_ADDR (SOC_SYS_REG_BASE + (0x47 << 2))

#define SYS_ANA_REG7_NSYN_POS (0)
#define SYS_ANA_REG7_NSYN_MASK (0x1)

#define SYS_ANA_REG7_BANDMANUAL_POS (1)
#define SYS_ANA_REG7_BANDMANUAL_MASK (0x3f)

#define SYS_ANA_REG7_CKREF_LOOP_SEL_POS (7)
#define SYS_ANA_REG7_CKREF_LOOP_SEL_MASK (0x1)

#define SYS_ANA_REG7_IOFFS_POS (8)
#define SYS_ANA_REG7_IOFFS_MASK (0x7)

#define SYS_ANA_REG7_RESET_NLOAD_POS (11)
#define SYS_ANA_REG7_RESET_NLOAD_MASK (0x1)

#define SYS_ANA_REG7_CLOSELOOP_EN_POS (12)
#define SYS_ANA_REG7_CLOSELOOP_EN_MASK (0x1)

#define SYS_ANA_REG7_ICTRLM_POS (13)
#define SYS_ANA_REG7_ICTRLM_MASK (0x1)

#define SYS_ANA_REG7_SPI_RSTN_POS (14)
#define SYS_ANA_REG7_SPI_RSTN_MASK (0x1)

#define SYS_ANA_REG7_OSCCAL_TRIG_POS (15)
#define SYS_ANA_REG7_OSCCAL_TRIG_MASK (0x1)

#define SYS_ANA_REG7_MANUAL_POS (16)
#define SYS_ANA_REG7_MANUAL_MASK (0x1)

#define SYS_ANA_REG7_DIFF_POS (17)
#define SYS_ANA_REG7_DIFF_MASK (0x7)

#define SYS_ANA_REG7_ICTRLMANUAL_POS (20)
#define SYS_ANA_REG7_ICTRLMANUAL_MASK (0x7)

#define SYS_ANA_REG7_CNTI_POS (23)
#define SYS_ANA_REG7_CNTI_MASK (0x1ff)

#define SYS_ANA_REG8_ADDR (SOC_SYS_REG_BASE + (0x48 << 2))

#define SYS_ANA_REG8_RESERVED_BIT_0_30_POS (0)
#define SYS_ANA_REG8_RESERVED_BIT_0_30_MASK (0x7fffffff)

#define SYS_ANA_REG8_N_POS (31)
#define SYS_ANA_REG8_N_MASK (0x1)

#define SYS_ANA_REG9_ADDR (SOC_SYS_REG_BASE + (0x49 << 2))

#define SYS_ANA_REG9_CLK_SEL_POS (0)
#define SYS_ANA_REG9_CLK_SEL_MASK (0x1)

#define SYS_ANA_REG9_CORELDO_HP_POS (1)
#define SYS_ANA_REG9_CORELDO_HP_MASK (0x1)

#define SYS_ANA_REG9_DLDOHP_POS (2)
#define SYS_ANA_REG9_DLDOHP_MASK (0x1)

#define SYS_ANA_REG9_T_VANALDOSEL_POS (3)
#define SYS_ANA_REG9_T_VANALDOSEL_MASK (0x7)

#define SYS_ANA_REG9_R_VANALDOSEL_POS (6)
#define SYS_ANA_REG9_R_VANALDOSEL_MASK (0x7)

#define SYS_ANA_REG9_EN_TRSW_POS (9)
#define SYS_ANA_REG9_EN_TRSW_MASK (0x1)

#define SYS_ANA_REG9_ALDOHP_POS (10)
#define SYS_ANA_REG9_ALDOHP_MASK (0x1)

#define SYS_ANA_REG9_ANACURLIM_POS (11)
#define SYS_ANA_REG9_ANACURLIM_MASK (0x1)

#define SYS_ANA_REG9_HSLDO_HP_POS (12)
#define SYS_ANA_REG9_HSLDO_HP_MASK (0x1)

#define SYS_ANA_REG9_PWD_HSLDO_POS (13)
#define SYS_ANA_REG9_PWD_HSLDO_MASK (0x1)

#define SYS_ANA_REG9_ENFAST_HSLDO_POS (14)
#define SYS_ANA_REG9_ENFAST_HSLDO_MASK (0x1)

#define SYS_ANA_REG9_VPORSEL_POS (15)
#define SYS_ANA_REG9_VPORSEL_MASK (0x1)

