bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_ANA_REG9_VALOLDOSEL_POS (16)
#define SYS_ANA_REG9_VALOLDOSEL_MASK (0x7)

#define SYS_ANA_REG9_ALOPOWSEL_POS (19)
#define SYS_ANA_REG9_ALOPOWSEL_MASK (0x1)

#define SYS_ANA_REG9_EN_FAST_ALOLDO_POS (20)
#define SYS_ANA_REG9_EN_FAST_ALOLDO_MASK (0x1)

#define SYS_ANA_REG9_ALOLDOHP_POS (21)
#define SYS_ANA_REG9_ALOLDOHP_MASK (0x1)

#define SYS_ANA_REG9_BGCAL_POS (22)
#define SYS_ANA_REG9_BGCAL_MASK (0x3f)

#define SYS_ANA_REG9_VBGCALMODE_POS (28)
#define SYS_ANA_REG9_VBGCALMODE_MASK (0x1)

#define SYS_ANA_REG9_VBGCALSTART_POS (29)
#define SYS_ANA_REG9_VBGCALSTART_MASK (0x1)

#define SYS_ANA_REG9_PWD_BGCAL_POS (30)
#define SYS_ANA_REG9_PWD_BGCAL_MASK (0x1)

#define SYS_ANA_REG9_SPI_ENVBG_POS (31)
#define SYS_ANA_REG9_SPI_ENVBG_MASK (0x1)

#define SYS_ANA_REG10_ADDR (SOC_SYS_REG_BASE + (0x4a << 2))

#define SYS_ANA_REG10_AZCD_MANUAL_POS (0)
#define SYS_ANA_REG10_AZCD_MANUAL_MASK (0x3f)

#define SYS_ANA_REG10_AZCDREFS_POS (6)
#define SYS_ANA_REG10_AZCDREFS_MASK (0x7)

#define SYS_ANA_REG10_SPI_LATCH1V_POS (9)
#define SYS_ANA_REG10_SPI_LATCH1V_MASK (0x1)

#define SYS_ANA_REG10_DIGCURLIM_POS (10)
#define SYS_ANA_REG10_DIGCURLIM_MASK (0x1)

#define SYS_ANA_REG10_RTC_WKRSTN_POS (11)
#define SYS_ANA_REG10_RTC_WKRSTN_MASK (0x1)

#define SYS_ANA_REG10_RST_WKS_POS (12)
#define SYS_ANA_REG10_RST_WKS_MASK (0x1)

#define SYS_ANA_REG10_D_VEASEL1V_POS (13)
#define SYS_ANA_REG10_D_VEASEL1V_MASK (0x3)

#define SYS_ANA_REG10_ENSFSDD_POS (15)
#define SYS_ANA_REG10_ENSFSDD_MASK (0x1)

#define SYS_ANA_REG10_VCOREHSEL_POS (16)
#define SYS_ANA_REG10_VCOREHSEL_MASK (0xf)

#define SYS_ANA_REG10_VCORELSEL_POS (20)
#define SYS_ANA_REG10_VCORELSEL_MASK (0x7)

#define SYS_ANA_REG10_VLDEN_POS (23)
#define SYS_ANA_REG10_VLDEN_MASK (0x1)

#define SYS_ANA_REG10_EN_FAST_CORELDO_POS (24)
#define SYS_ANA_REG10_EN_FAST_CORELDO_MASK (0x1)

#define SYS_ANA_REG10_PWDCORELDO_POS (25)
#define SYS_ANA_REG10_PWDCORELDO_MASK (0x1)

#define SYS_ANA_REG10_VDIGHSEL_POS (26)
#define SYS_ANA_REG10_VDIGHSEL_MASK (0x7)

#define SYS_ANA_REG10_VDIGLSEL_POS (29)
#define SYS_ANA_REG10_VDIGLSEL_MASK (0x3)

#define SYS_ANA_REG10_VDD12LDEN_POS (31)
#define SYS_ANA_REG10_VDD12LDEN_MASK (0x1)

#define SYS_ANA_REG11_ADDR (SOC_SYS_REG_BASE + (0x4b << 2))

#define SYS_ANA_REG11_ALDO_CZSEL_POS (0)
#define SYS_ANA_REG11_ALDO_CZSEL_MASK (0x7)

#define SYS_ANA_REG11_ZLDO_RZSEL_POS (3)
#define SYS_ANA_REG11_ZLDO_RZSEL_MASK (0x3)

#define SYS_ANA_REG11_AZCDSWVS_POS (5)
#define SYS_ANA_REG11_AZCDSWVS_MASK (0x7)

#define SYS_ANA_REG11_AENZCDDY_POS (8)
#define SYS_ANA_REG11_AENZCDDY_MASK (0x1)

#define SYS_ANA_REG11_AENZCDMSEL_POS (9)
#define SYS_ANA_REG11_AENZCDMSEL_MASK (0x1)

#define SYS_ANA_REG11_AENZCDCALIB_POS (10)
#define SYS_ANA_REG11_AENZCDCALIB_MASK (0x1)

#define SYS_ANA_REG11_EN_COREPSW_POS (11)
#define SYS_ANA_REG11_EN_COREPSW_MASK (0x1)

#define SYS_ANA_REG11_EN_ALOPSW_POS (12)
#define SYS_ANA_REG11_EN_ALOPSW_MASK (0x1)

#define SYS_ANA_REG11_VBATDETSEL_POS (13)
#define SYS_ANA_REG11_VBATDETSEL_MASK (0x3)

#define SYS_ANA_REG11_SPI_TIMERWKEN_POS (15)
#define SYS_ANA_REG11_SPI_TIMERWKEN_MASK (0x1)

#define SYS_ANA_REG11_SPI_BYP32PWD_POS (16)
#define SYS_ANA_REG11_SPI_BYP32PWD_MASK (0x1)

#define SYS_ANA_REG11_SD_POS (17)
#define SYS_ANA_REG11_SD_MASK (0x1)

#define SYS_ANA_REG11_TIMER_WKRSTN_POS (18)
#define SYS_ANA_REG11_TIMER_WKRSTN_MASK (0x1)

#define SYS_ANA_REG11_GPIO_WKRST1V_POS (19)
#define SYS_ANA_REG11_GPIO_WKRST1V_MASK (0x1)

#define SYS_ANA_REG11_CKFS_POS (20)
#define SYS_ANA_REG11_CKFS_MASK (0x3)

#define SYS_ANA_REG11_CKINTSEL_POS (22)
#define SYS_ANA_REG11_CKINTSEL_MASK (0x1)

#define SYS_ANA_REG11_OSCCALTRIG_POS (23)
#define SYS_ANA_REG11_OSCCALTRIG_MASK (0x1)

#define SYS_ANA_REG11_MROSCSEL_POS (24)
#define SYS_ANA_REG11_MROSCSEL_MASK (0x1)

#define SYS_ANA_REG11_MROSCI_CAL_POS (25)
#define SYS_ANA_REG11_MROSCI_CAL_MASK (0x7)

#define SYS_ANA_REG11_MROSCCAP_CAL_POS (28)
#define SYS_ANA_REG11_MROSCCAP_CAL_MASK (0xf)

#define SYS_ANA_REG12_ADDR (SOC_SYS_REG_BASE + (0x4c << 2))

#define SYS_ANA_REG12_SFSR_POS (0)
#define SYS_ANA_REG12_SFSR_MASK (0xf)

#define SYS_ANA_REG12_ENSFSAA_POS (4)
#define SYS_ANA_REG12_ENSFSAA_MASK (0x1)

#define SYS_ANA_REG12_APFMS_POS (5)
#define SYS_ANA_REG12_APFMS_MASK (0x1f)

#define SYS_ANA_REG12_ATMPO_SEL_POS (10)
#define SYS_ANA_REG12_ATMPO_SEL_MASK (0x3)

#define SYS_ANA_REG12_AMPOEN_POS (12)
#define SYS_ANA_REG12_AMPOEN_MASK (0x1)

#define SYS_ANA_REG12_ENPOWA_POS (13)
#define SYS_ANA_REG12_ENPOWA_MASK (0x1)

#define SYS_ANA_REG12_AVEA_SEL_POS (14)
#define SYS_ANA_REG12_AVEA_SEL_MASK (0x3)

#define SYS_ANA_REG12_AFORCEPFM_POS (16)
#define SYS_ANA_REG12_AFORCEPFM_MASK (0x1)

#define SYS_ANA_REG12_ACLS_POS (17)
#define SYS_ANA_REG12_ACLS_MASK (0x7)

#define SYS_ANA_REG12_ASWRSTEN_POS (20)
#define SYS_ANA_REG12_ASWRSTEN_MASK (0x1)

#define SYS_ANA_REG12_ARIPC_POS (21)
#define SYS_ANA_REG12_ARIPC_MASK (0x7)

#define SYS_ANA_REG12_ARAMPC_POS (24)
#define SYS_ANA_REG12_ARAMPC_MASK (0xf)

#define SYS_ANA_REG12_ARAMPCEN_POS (28)
#define SYS_ANA_REG12_ARAMPCEN_MASK (0x1)

#define SYS_ANA_REG12_AENBURST_POS (29)
#define SYS_ANA_REG12_AENBURST_MASK (0x1)

#define SYS_ANA_REG12_APFMEN_POS (30)
#define SYS_ANA_REG12_APFMEN_MASK (0x1)

#define SYS_ANA_REG12_ALDOSEL_POS (31)
#define SYS_ANA_REG12_ALDOSEL_MASK (0x1)

#define SYS_ANA_REG13_ADDR (SOC_SYS_REG_BASE + (0x4d << 2))

#define SYS_ANA_REG13_BUCKD_SOFTST_POS (0)
#define SYS_ANA_REG13_BUCKD_SOFTST_MASK (0xf)

#define SYS_ANA_REG13_DENZCDCALIB_POS (4)
#define SYS_ANA_REG13_DENZCDCALIB_MASK (0x1)

#define SYS_ANA_REG13_DZCDMSEL_POS (5)
#define SYS_ANA_REG13_DZCDMSEL_MASK (0x1)

#define SYS_ANA_REG13_VBD_RSTRTC_EN_POS (6)
#define SYS_ANA_REG13_VBD_RSTRTC_EN_MASK (0x1)

#define SYS_ANA_REG13_VDDGPIO_SEL_POS (7)
#define SYS_ANA_REG13_VDDGPIO_SEL_MASK (0x1)

#define SYS_ANA_REG13_DPFMS_POS (8)
#define SYS_ANA_REG13_DPFMS_MASK (0x1f)

#define SYS_ANA_REG13_DTMPO_SEL_POS (13)
#define SYS_ANA_REG13_DTMPO_SEL_MASK (0x3)

