bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_ANA_REG20_AUDADJREF_POS (27)
#define SYS_ANA_REG20_AUDADJREF_MASK (0x1f)

#define SYS_ANA_REG21_ADDR (SOC_SYS_REG_BASE + (0x55 << 2))

#define SYS_ANA_REG21_ISEL_MIC1_POS (0)
#define SYS_ANA_REG21_ISEL_MIC1_MASK (0x3)

#define SYS_ANA_REG21_MICIRSEL1_MIC1_POS (2)
#define SYS_ANA_REG21_MICIRSEL1_MIC1_MASK (0x1)

#define SYS_ANA_REG21_VCMSEL_MIC1_POS (3)
#define SYS_ANA_REG21_VCMSEL_MIC1_MASK (0x1)

#define SYS_ANA_REG21_ENFSR_MIC1_POS (4)
#define SYS_ANA_REG21_ENFSR_MIC1_MASK (0x1)

#define SYS_ANA_REG21_ENOPOCLIP_MIC1_POS (5)
#define SYS_ANA_REG21_ENOPOCLIP_MIC1_MASK (0x1)

#define SYS_ANA_REG21_DA2ADEN_MIC1_POS (6)
#define SYS_ANA_REG21_DA2ADEN_MIC1_MASK (0x1)

#define SYS_ANA_REG21_IMATCH_MIC1_POS (7)
#define SYS_ANA_REG21_IMATCH_MIC1_MASK (0xf)

#define SYS_ANA_REG21_IMATCH_EN_MIC1_POS (11)
#define SYS_ANA_REG21_IMATCH_EN_MIC1_MASK (0x1)

#define SYS_ANA_REG21_DCCOMPEN_MIC1_POS (12)
#define SYS_ANA_REG21_DCCOMPEN_MIC1_MASK (0x1)

#define SYS_ANA_REG21_MICSINGLEEN_MIC1_POS (13)
#define SYS_ANA_REG21_MICSINGLEEN_MIC1_MASK (0x1)

#define SYS_ANA_REG21_NC_14_14_POS (14)
#define SYS_ANA_REG21_NC_14_14_MASK (0x1)

#define SYS_ANA_REG21_MICGAIN_MIC1_POS (15)
#define SYS_ANA_REG21_MICGAIN_MIC1_MASK (0xf)

#define SYS_ANA_REG21_NC_19_23_POS (19)
#define SYS_ANA_REG21_NC_19_23_MASK (0x1f)

#define SYS_ANA_REG21_DWAMODE_MIC1_POS (24)
#define SYS_ANA_REG21_DWAMODE_MIC1_MASK (0x1)

#define SYS_ANA_REG21_NC_25_27_POS (25)
#define SYS_ANA_REG21_NC_25_27_MASK (0x7)

#define SYS_ANA_REG21_MICEN_MIC1_POS (28)
#define SYS_ANA_REG21_MICEN_MIC1_MASK (0x1)

#define SYS_ANA_REG21_RST_MIC1_POS (29)
#define SYS_ANA_REG21_RST_MIC1_MASK (0x1)

#define SYS_ANA_REG21_BPDWA1V_MIC1_POS (30)
#define SYS_ANA_REG21_BPDWA1V_MIC1_MASK (0x1)

#define SYS_ANA_REG21_HCEN1STG_MIC1_POS (31)
#define SYS_ANA_REG21_HCEN1STG_MIC1_MASK (0x1)

#define SYS_ANA_REG22_ADDR (SOC_SYS_REG_BASE + (0x56 << 2))

#define SYS_ANA_REG22_INBUFFER_ISEL_POS (0)
#define SYS_ANA_REG22_INBUFFER_ISEL_MASK (0x3)

#define SYS_ANA_REG22_GADC_OFFSET_EN_POS (2)
#define SYS_ANA_REG22_GADC_OFFSET_EN_MASK (0x1)

#define SYS_ANA_REG22_GADC_VREF_SEL_POS (3)
#define SYS_ANA_REG22_GADC_VREF_SEL_MASK (0x1)

#define SYS_ANA_REG22_GADC_BUFAMP_ISEL_POS (4)
#define SYS_ANA_REG22_GADC_BUFAMP_ISEL_MASK (0x7)

#define SYS_ANA_REG22_GADC_PREAMP_ISEL_POS (7)
#define SYS_ANA_REG22_GADC_PREAMP_ISEL_MASK (0x7)

#define SYS_ANA_REG22_GADC_COMP_ISEL_POS (10)
#define SYS_ANA_REG22_GADC_COMP_ISEL_MASK (0x7)

#define SYS_ANA_REG22_GADC_BSCALSAW_POS (13)
#define SYS_ANA_REG22_GADC_BSCALSAW_MASK (0x7)

#define SYS_ANA_REG22_GADC_VNCALSAW_POS (16)
#define SYS_ANA_REG22_GADC_VNCALSAW_MASK (0x7)

#define SYS_ANA_REG22_GADC_VPCALSAW_POS (19)
#define SYS_ANA_REG22_GADC_VPCALSAW_MASK (0x7)

#define SYS_ANA_REG22_IREFEN_POS (22)
#define SYS_ANA_REG22_IREFEN_MASK (0x1)

#define SYS_ANA_REG22_GADC_VBG_SEL_POS (23)
#define SYS_ANA_REG22_GADC_VBG_SEL_MASK (0x1)

#define SYS_ANA_REG22_GADC_CLK_RLTEN_POS (24)
#define SYS_ANA_REG22_GADC_CLK_RLTEN_MASK (0x1)

#define SYS_ANA_REG22_GADC_CALINTSAW_EN_POS (25)
#define SYS_ANA_REG22_GADC_CALINTSAW_EN_MASK (0x1)

#define SYS_ANA_REG22_GADC_CLK_SEL_POS (26)
#define SYS_ANA_REG22_GADC_CLK_SEL_MASK (0x1)

#define SYS_ANA_REG22_GADC_CLK_IN_POS (27)
#define SYS_ANA_REG22_GADC_CLK_IN_MASK (0x1)

#define SYS_ANA_REG22_GADC_CALCAP_CH_POS (28)
#define SYS_ANA_REG22_GADC_CALCAP_CH_MASK (0x3)

#define SYS_ANA_REG22_GADC_INBUF_EN_POS (30)
#define SYS_ANA_REG22_GADC_INBUF_EN_MASK (0x1)

#define SYS_ANA_REG22_GADC_EN_SPI_POS (31)
#define SYS_ANA_REG22_GADC_EN_SPI_MASK (0x1)

#define SYS_ANA_REG23_ADDR (SOC_SYS_REG_BASE + (0x57 << 2))

#define SYS_ANA_REG23_VADCKINVEN_POS (0)
#define SYS_ANA_REG23_VADCKINVEN_MASK (0x1)

#define SYS_ANA_REG23_VADREFSEL_POS (1)
#define SYS_ANA_REG23_VADREFSEL_MASK (0x1)

#define SYS_ANA_REG23_VAD_RSTN_POS (2)
#define SYS_ANA_REG23_VAD_RSTN_MASK (0x1)

#define SYS_ANA_REG23_VAD_VINISET_POS (3)
#define SYS_ANA_REG23_VAD_VINISET_MASK (0x1)

#define SYS_ANA_REG23_VAD_CSTRM_POS (4)
#define SYS_ANA_REG23_VAD_CSTRM_MASK (0x3)

#define SYS_ANA_REG23_VAD_CFTRM_POS (6)
#define SYS_ANA_REG23_VAD_CFTRM_MASK (0x3)

#define SYS_ANA_REG23_VAD_EN_POS (8)
#define SYS_ANA_REG23_VAD_EN_MASK (0x1)

#define SYS_ANA_REG23_VAD_CTRL0_POS (9)
#define SYS_ANA_REG23_VAD_CTRL0_MASK (0x7fffff)

#define SYS_ANA_REG24_ADDR (SOC_SYS_REG_BASE + (0x58 << 2))

#define SYS_ANA_REG24_VAD_CTRL1_POS (0)
#define SYS_ANA_REG24_VAD_CTRL1_MASK (0xffffffff)

#define SYS_ANA_REG25_ADDR (SOC_SYS_REG_BASE + (0x59 << 2))

#define SYS_ANA_REG25_INT_MOD_POS (0)
#define SYS_ANA_REG25_INT_MOD_MASK (0x1)

#define SYS_ANA_REG25_NSYN_POS (1)
#define SYS_ANA_REG25_NSYN_MASK (0x1)

#define SYS_ANA_REG25_OPEN_ENB_POS (2)
#define SYS_ANA_REG25_OPEN_ENB_MASK (0x1)

#define SYS_ANA_REG25_RESET_POS (3)
#define SYS_ANA_REG25_RESET_MASK (0x1)

#define SYS_ANA_REG25_IOFFSETL_POS (4)
#define SYS_ANA_REG25_IOFFSETL_MASK (0x7)

#define SYS_ANA_REG25_LPFRZ_POS (7)
#define SYS_ANA_REG25_LPFRZ_MASK (0xf)

#define SYS_ANA_REG25_VSEL_POS (11)
#define SYS_ANA_REG25_VSEL_MASK (0x7)

#define SYS_ANA_REG25_VSEL_CAL_POS (14)
#define SYS_ANA_REG25_VSEL_CAL_MASK (0x1)

#define SYS_ANA_REG25_PWD_LOCKDET_POS (15)
#define SYS_ANA_REG25_PWD_LOCKDET_MASK (0x1)

#define SYS_ANA_REG25_LOCKDET_BYPASS_POS (16)
#define SYS_ANA_REG25_LOCKDET_BYPASS_MASK (0x1)

#define SYS_ANA_REG25_CKREF_LOOP_SEL_POS (17)
#define SYS_ANA_REG25_CKREF_LOOP_SEL_MASK (0x1)

#define SYS_ANA_REG25_SPI_TRIGGER_POS (18)
#define SYS_ANA_REG25_SPI_TRIGGER_MASK (0x1)

#define SYS_ANA_REG25_MANUAL_POS (19)
#define SYS_ANA_REG25_MANUAL_MASK (0x1)

#define SYS_ANA_REG25_TEST_CKAUDIO_EN_POS (20)
#define SYS_ANA_REG25_TEST_CKAUDIO_EN_MASK (0x1)

#define SYS_ANA_REG25_CK2XEN_POS (21)
#define SYS_ANA_REG25_CK2XEN_MASK (0x1)

#define SYS_ANA_REG25_ICP_POS (22)
#define SYS_ANA_REG25_ICP_MASK (0x3)

#define SYS_ANA_REG25_CKTST_SEL_POS (24)
#define SYS_ANA_REG25_CKTST_SEL_MASK (0x1)

#define SYS_ANA_REG25_EDGESEL_NCK_POS (25)
#define SYS_ANA_REG25_EDGESEL_NCK_MASK (0x1)

