bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_ANA_REG29_DACMUTE_POS (26)
#define SYS_ANA_REG29_DACMUTE_MASK (0x1)

#define SYS_ANA_REG29_DACDWAMODE_SEL_POS (27)
#define SYS_ANA_REG29_DACDWAMODE_SEL_MASK (0x1)

#define SYS_ANA_REG29_CKPSEL_POS (28)
#define SYS_ANA_REG29_CKPSEL_MASK (0x1)

#define SYS_ANA_REG29_NC_29_31_POS (29)
#define SYS_ANA_REG29_NC_29_31_MASK (0x7)

#define SYS_ANA_REG30_ADDR (SOC_SYS_REG_BASE + (0x5e << 2))

#define SYS_ANA_REG30_LMDCIN_POS (0)
#define SYS_ANA_REG30_LMDCIN_MASK (0xff)

#define SYS_ANA_REG30_RMDCIN_POS (8)
#define SYS_ANA_REG30_RMDCIN_MASK (0xff)

#define SYS_ANA_REG30_SPIRST_OVC_POS (16)
#define SYS_ANA_REG30_SPIRST_OVC_MASK (0x1)

#define SYS_ANA_REG30_ENIDACR_POS (17)
#define SYS_ANA_REG30_ENIDACR_MASK (0x1)

#define SYS_ANA_REG30_ENIDACL_POS (18)
#define SYS_ANA_REG30_ENIDACL_MASK (0x1)

#define SYS_ANA_REG30_DAC3RDHC0V9_POS (19)
#define SYS_ANA_REG30_DAC3RDHC0V9_MASK (0x1)

#define SYS_ANA_REG30_HC2S_POS (20)
#define SYS_ANA_REG30_HC2S_MASK (0x1)

#define SYS_ANA_REG30_SNG_FB_EN_POS (21)
#define SYS_ANA_REG30_SNG_FB_EN_MASK (0x1)

#define SYS_ANA_REG30_RFB_CTRL_POS (22)
#define SYS_ANA_REG30_RFB_CTRL_MASK (0x1)

#define SYS_ANA_REG30_ENBS_POS (23)
#define SYS_ANA_REG30_ENBS_MASK (0x1)

#define SYS_ANA_REG30_CALCK_SEL0V9_POS (24)
#define SYS_ANA_REG30_CALCK_SEL0V9_MASK (0x1)

#define SYS_ANA_REG30_BPDWA0V9_POS (25)
#define SYS_ANA_REG30_BPDWA0V9_MASK (0x1)

#define SYS_ANA_REG30_LOOPRST0V9_POS (26)
#define SYS_ANA_REG30_LOOPRST0V9_MASK (0x1)

#define SYS_ANA_REG30_OCT0V9_POS (27)
#define SYS_ANA_REG30_OCT0V9_MASK (0x3)

#define SYS_ANA_REG30_SOUT0V9_POS (29)
#define SYS_ANA_REG30_SOUT0V9_MASK (0x1)

#define SYS_ANA_REG30_HC0V9_POS (30)
#define SYS_ANA_REG30_HC0V9_MASK (0x3)

#define SYS_ANA_REG31_ADDR (SOC_SYS_REG_BASE + (0x5f << 2))

#define SYS_ANA_REG31_NC_0_31_POS (0)
#define SYS_ANA_REG31_NC_0_31_MASK (0xffffffff)

#define SYS_ANA_REG32_ADDR (SOC_SYS_REG_BASE + (0x60 << 2))

#define SYS_ANA_REG32_NC_0_2_POS (0)
#define SYS_ANA_REG32_NC_0_2_MASK (0x7)

#define SYS_ANA_REG32_VAD_CK_SEL_POS (3)
#define SYS_ANA_REG32_VAD_CK_SEL_MASK (0x1)

#define SYS_ANA_REG32_INT_SEL_POS (4)
#define SYS_ANA_REG32_INT_SEL_MASK (0x1)

#define SYS_ANA_REG32_LDOEN_POS (5)
#define SYS_ANA_REG32_LDOEN_MASK (0x1)

#define SYS_ANA_REG32_LDOCTRL_POS (6)
#define SYS_ANA_REG32_LDOCTRL_MASK (0x1)

#define SYS_ANA_REG32_IBCTRL_POS (7)
#define SYS_ANA_REG32_IBCTRL_MASK (0x1)

#define SYS_ANA_REG32_RSTB_DIG_POS (8)
#define SYS_ANA_REG32_RSTB_DIG_MASK (0x1)

#define SYS_ANA_REG32_EN_VTEST_SEL_POS (9)
#define SYS_ANA_REG32_EN_VTEST_SEL_MASK (0x1)

#define SYS_ANA_REG32_EN_ADCMOD_POS (10)
#define SYS_ANA_REG32_EN_ADCMOD_MASK (0x1)

#define SYS_ANA_REG32_EN_OUT_TEST_POS (11)
#define SYS_ANA_REG32_EN_OUT_TEST_MASK (0x1)

#define SYS_ANA_REG32_NC_12_12_POS (12)
#define SYS_ANA_REG32_NC_12_12_MASK (0x1)

#define SYS_ANA_REG32_SEL_SERI_CAP_POS (13)
#define SYS_ANA_REG32_SEL_SERI_CAP_MASK (0x1)

#define SYS_ANA_REG32_EN_SERI_CAP_POS (14)
#define SYS_ANA_REG32_EN_SERI_CAP_MASK (0x1)

#define SYS_ANA_REG32_CAL_CTRL_POS (15)
#define SYS_ANA_REG32_CAL_CTRL_MASK (0x3)

#define SYS_ANA_REG32_CAL_VTH_POS (17)
#define SYS_ANA_REG32_CAL_VTH_MASK (0x7)

#define SYS_ANA_REG32_CRG_POS (20)
#define SYS_ANA_REG32_CRG_MASK (0x3)

#define SYS_ANA_REG32_VREFS_POS (22)
#define SYS_ANA_REG32_VREFS_MASK (0xf)

#define SYS_ANA_REG32_GAIN_S_POS (26)
#define SYS_ANA_REG32_GAIN_S_MASK (0xf)

#define SYS_ANA_REG32_TD_LATCH_POS (30)
#define SYS_ANA_REG32_TD_LATCH_MASK (0x1)

#define SYS_ANA_REG32_PWD_TD_POS (31)
#define SYS_ANA_REG32_PWD_TD_MASK (0x1)

#define SYS_ANA_REG33_ADDR (SOC_SYS_REG_BASE + (0x61 << 2))

#define SYS_ANA_REG33_TEST_NUMBER_POS (0)
#define SYS_ANA_REG33_TEST_NUMBER_MASK (0xf)

#define SYS_ANA_REG33_TEST_PERIOD_POS (4)
#define SYS_ANA_REG33_TEST_PERIOD_MASK (0xf)

#define SYS_ANA_REG33_CHS_POS (8)
#define SYS_ANA_REG33_CHS_MASK (0xffff)

#define SYS_ANA_REG33_CHS_SEL_CAL_POS (24)
#define SYS_ANA_REG33_CHS_SEL_CAL_MASK (0xf)

#define SYS_ANA_REG33_CAL_DONE_CLR_POS (28)
#define SYS_ANA_REG33_CAL_DONE_CLR_MASK (0x1)

#define SYS_ANA_REG33_EN_CAL_FORCE_POS (29)
#define SYS_ANA_REG33_EN_CAL_FORCE_MASK (0x1)

#define SYS_ANA_REG33_EN_CAL_AUTO_POS (30)
#define SYS_ANA_REG33_EN_CAL_AUTO_MASK (0x1)

#define SYS_ANA_REG33_EN_SCAN_POS (31)
#define SYS_ANA_REG33_EN_SCAN_MASK (0x1)

#define SYS_ANA_REG34_ADDR (SOC_SYS_REG_BASE + (0x62 << 2))

#define SYS_ANA_REG34_INT_EN_POS (0)
#define SYS_ANA_REG34_INT_EN_MASK (0x1ffff)

#define SYS_ANA_REG34_NC_17_17_POS (17)
#define SYS_ANA_REG34_NC_17_17_MASK (0x1)

#define SYS_ANA_REG34_MODSEL_SPI_POS (18)
#define SYS_ANA_REG34_MODSEL_SPI_MASK (0x1)

#define SYS_ANA_REG34_CAL_NUMBER_POS (19)
#define SYS_ANA_REG34_CAL_NUMBER_MASK (0xf)

#define SYS_ANA_REG34_CL_PERIOD_POS (23)
#define SYS_ANA_REG34_CL_PERIOD_MASK (0x1ff)

#define SYS_ANA_REG35_ADDR (SOC_SYS_REG_BASE + (0x63 << 2))

#define SYS_ANA_REG35_INT_CLR_POS (0)
#define SYS_ANA_REG35_INT_CLR_MASK (0x1ffff)

#define SYS_ANA_REG35_NC_17_17_POS (17)
#define SYS_ANA_REG35_NC_17_17_MASK (0x1)

#define SYS_ANA_REG35_INT_CLR_SEL_POS (18)
#define SYS_ANA_REG35_INT_CLR_SEL_MASK (0x1)

#define SYS_ANA_REG35_EN_LPMOD_POS (19)
#define SYS_ANA_REG35_EN_LPMOD_MASK (0x1)

#define SYS_ANA_REG35_EN_TESTCMP_POS (20)
#define SYS_ANA_REG35_EN_TESTCMP_MASK (0x1)

#define SYS_ANA_REG35_EN_MAN_WR_POS (21)
#define SYS_ANA_REG35_EN_MAN_WR_MASK (0x1)

#define SYS_ANA_REG35_EN_MANMODE_POS (22)
#define SYS_ANA_REG35_EN_MANMODE_MASK (0x1)

#define SYS_ANA_REG35_CAP_CALSPI_POS (23)
#define SYS_ANA_REG35_CAP_CALSPI_MASK (0x1ff)

#define SYS_ANA_REG36_ADDR (SOC_SYS_REG_BASE + (0x64 << 2))

#define SYS_ANA_REG36_INT_CLR_CAL_POS (0)
#define SYS_ANA_REG36_INT_CLR_CAL_MASK (0xffff)

#define SYS_ANA_REG36_INT_EN_CAL_POS (16)
#define SYS_ANA_REG36_INT_EN_CAL_MASK (0xffff)

#define SYS_ANA_REG37_ADDR (SOC_SYS_REG_BASE + (0x65 << 2))

#define SYS_ANA_REG37_RESET_POS (0)
#define SYS_ANA_REG37_RESET_MASK (0x1)

#define SYS_ANA_REG37_CLEAR_INT_POS (1)
#define SYS_ANA_REG37_CLEAR_INT_MASK (0x1)

