bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_ANA_REG37_XMIN_INIT_POS (2)
#define SYS_ANA_REG37_XMIN_INIT_MASK (0x1)

#define SYS_ANA_REG37_GAIN_POS (3)
#define SYS_ANA_REG37_GAIN_MASK (0xf)

#define SYS_ANA_REG37_ALPHAL_POS (7)
#define SYS_ANA_REG37_ALPHAL_MASK (0x7)

#define SYS_ANA_REG37_ALPHAS_POS (10)
#define SYS_ANA_REG37_ALPHAS_MASK (0x7)

#define SYS_ANA_REG37_LPFN_POS (13)
#define SYS_ANA_REG37_LPFN_MASK (0x7)

#define SYS_ANA_REG37_HPFN_POS (16)
#define SYS_ANA_REG37_HPFN_MASK (0x7)

#define SYS_ANA_REG37_LPF_BYPASS_POS (19)
#define SYS_ANA_REG37_LPF_BYPASS_MASK (0x1)

#define SYS_ANA_REG37_HPF_BYPASS_POS (20)
#define SYS_ANA_REG37_HPF_BYPASS_MASK (0x1)

#define SYS_ANA_REG37_IS_ABS_POS (21)
#define SYS_ANA_REG37_IS_ABS_MASK (0x1)

#define SYS_ANA_REG37_DIR_POS (22)
#define SYS_ANA_REG37_DIR_MASK (0x1)

#define SYS_ANA_REG37_NC_23_31_POS (23)
#define SYS_ANA_REG37_NC_23_31_MASK (0x1ff)

#define SYS_ANA_REG38_ADDR (SOC_SYS_REG_BASE + (0x66 << 2))

#define SYS_ANA_REG38_ALPHA_POS (0)
#define SYS_ANA_REG38_ALPHA_MASK (0xff)

#define SYS_ANA_REG38_COMP_POS (8)
#define SYS_ANA_REG38_COMP_MASK (0xfff)

#define SYS_ANA_REG38_CNTN_POS (20)
#define SYS_ANA_REG38_CNTN_MASK (0xfff)

#define SYS_ANA_REG39_ADDR (SOC_SYS_REG_BASE + (0x67 << 2))

#define SYS_ANA_REG39_ENSPI_I_POS (0)
#define SYS_ANA_REG39_ENSPI_I_MASK (0x1)

#define SYS_ANA_REG39_CK_EDGE_I_POS (1)
#define SYS_ANA_REG39_CK_EDGE_I_MASK (0x1)

#define SYS_ANA_REG39_OUTBUFF_ISEL_I_POS (2)
#define SYS_ANA_REG39_OUTBUFF_ISEL_I_MASK (0x7)

#define SYS_ANA_REG39_REFBUFF_ISEL_I_POS (5)
#define SYS_ANA_REG39_REFBUFF_ISEL_I_MASK (0x7)

#define SYS_ANA_REG39_CAP_FB_SEL_I_POS (8)
#define SYS_ANA_REG39_CAP_FB_SEL_I_MASK (0xf)

#define SYS_ANA_REG39_GAIN_SEL_I_POS (12)
#define SYS_ANA_REG39_GAIN_SEL_I_MASK (0x7)

#define SYS_ANA_REG39_VREF_CAL_SEL_I_POS (15)
#define SYS_ANA_REG39_VREF_CAL_SEL_I_MASK (0x1f)

#define SYS_ANA_REG39_CAP_CAL_SEL_I_POS (20)
#define SYS_ANA_REG39_CAP_CAL_SEL_I_MASK (0xf)

#define SYS_ANA_REG39_CAL_DIRECTION_I_POS (24)
#define SYS_ANA_REG39_CAL_DIRECTION_I_MASK (0x1)

#define SYS_ANA_REG39_ENDIGSPI_SEL_I_POS (25)
#define SYS_ANA_REG39_ENDIGSPI_SEL_I_MASK (0x1)

#define SYS_ANA_REG39_NC_26_31_POS (26)
#define SYS_ANA_REG39_NC_26_31_MASK (0x3f)

#define SYS_ANA_REG40_ADDR (SOC_SYS_REG_BASE + (0x68 << 2))

#define SYS_ANA_REG40_ENSPI_Q_POS (0)
#define SYS_ANA_REG40_ENSPI_Q_MASK (0x1)

#define SYS_ANA_REG40_CK_EDGE_Q_POS (1)
#define SYS_ANA_REG40_CK_EDGE_Q_MASK (0x1)

#define SYS_ANA_REG40_OUTBUFF_QSEL_Q_POS (2)
#define SYS_ANA_REG40_OUTBUFF_QSEL_Q_MASK (0x7)

#define SYS_ANA_REG40_REFBUFF_QSEL_Q_POS (5)
#define SYS_ANA_REG40_REFBUFF_QSEL_Q_MASK (0x7)

#define SYS_ANA_REG40_CAP_FB_SEL_Q_POS (8)
#define SYS_ANA_REG40_CAP_FB_SEL_Q_MASK (0xf)

#define SYS_ANA_REG40_GAIN_SEL_Q_POS (12)
#define SYS_ANA_REG40_GAIN_SEL_Q_MASK (0x7)

#define SYS_ANA_REG40_VREF_CAL_SEL_Q_POS (15)
#define SYS_ANA_REG40_VREF_CAL_SEL_Q_MASK (0x1f)

#define SYS_ANA_REG40_CAP_CAL_SEL_Q_POS (20)
#define SYS_ANA_REG40_CAP_CAL_SEL_Q_MASK (0xf)

#define SYS_ANA_REG40_CAL_DIRECTION_Q_POS (24)
#define SYS_ANA_REG40_CAL_DIRECTION_Q_MASK (0x1)

#define SYS_ANA_REG40_ENDIGSPI_SEL_Q_POS (25)
#define SYS_ANA_REG40_ENDIGSPI_SEL_Q_MASK (0x1)

#define SYS_ANA_REG40_NC_26_31_POS (26)
#define SYS_ANA_REG40_NC_26_31_MASK (0x3f)

#define SYS_ANA_REG41_ADDR (SOC_SYS_REG_BASE + (0x69 << 2))

#define SYS_ANA_REG41_NC_0_10_POS (0)
#define SYS_ANA_REG41_NC_0_10_MASK (0x7ff)

#define SYS_ANA_REG41_VSEL_AUXLDO3V_POS (11)
#define SYS_ANA_REG41_VSEL_AUXLDO3V_MASK (0xf)

#define SYS_ANA_REG41_VSEL_AUXLDO2P8V_POS (15)
#define SYS_ANA_REG41_VSEL_AUXLDO2P8V_MASK (0xf)

#define SYS_ANA_REG41_VSEL_AUXLDO1P8V_POS (19)
#define SYS_ANA_REG41_VSEL_AUXLDO1P8V_MASK (0xf)

#define SYS_ANA_REG41_VSEL_AUXLDO1P2V_POS (23)
#define SYS_ANA_REG41_VSEL_AUXLDO1P2V_MASK (0x7)

#define SYS_ANA_REG41_SWB_AUXLDO3V_POS (26)
#define SYS_ANA_REG41_SWB_AUXLDO3V_MASK (0x1)

#define SYS_ANA_REG41_SWB_AUXLDO2P8V_POS (27)
#define SYS_ANA_REG41_SWB_AUXLDO2P8V_MASK (0x1)

#define SYS_ANA_REG41_EN_AUXLDO3V_POS (28)
#define SYS_ANA_REG41_EN_AUXLDO3V_MASK (0x1)

#define SYS_ANA_REG41_EN_AUXLDO2P8V_POS (29)
#define SYS_ANA_REG41_EN_AUXLDO2P8V_MASK (0x1)

#define SYS_ANA_REG41_EN_AUXLDO_1P8V_POS (30)
#define SYS_ANA_REG41_EN_AUXLDO_1P8V_MASK (0x1)

#define SYS_ANA_REG41_EN_AUXLDO_1P2V_POS (31)
#define SYS_ANA_REG41_EN_AUXLDO_1P2V_MASK (0x1)

#define SYS_ANA_REG42_ADDR (SOC_SYS_REG_BASE + (0x6a << 2))

#define SYS_ANA_REG42_NC_0_9_POS (0)
#define SYS_ANA_REG42_NC_0_9_MASK (0x3ff)

#define SYS_ANA_REG42_DSLEP_DISABLE_POS (10)
#define SYS_ANA_REG42_DSLEP_DISABLE_MASK (0x1)

#define SYS_ANA_REG42_EN_VOUT_POS (11)
#define SYS_ANA_REG42_EN_VOUT_MASK (0x1)

#define SYS_ANA_REG42_VUSBSEL_POS (12)
#define SYS_ANA_REG42_VUSBSEL_MASK (0x3)

#define SYS_ANA_REG42_USBNEN_DN_POS (14)
#define SYS_ANA_REG42_USBNEN_DN_MASK (0xf)

#define SYS_ANA_REG42_USBPEN_DN_POS (18)
#define SYS_ANA_REG42_USBPEN_DN_MASK (0xf)

#define SYS_ANA_REG42_USBNEN_DP_POS (22)
#define SYS_ANA_REG42_USBNEN_DP_MASK (0xf)

#define SYS_ANA_REG42_USBPEN_DP_POS (26)
#define SYS_ANA_REG42_USBPEN_DP_MASK (0xf)

#define SYS_ANA_REG42_USB_SPEED_POS (30)
#define SYS_ANA_REG42_USB_SPEED_MASK (0x1)

#define SYS_ANA_REG42_PWD_USB_POS (31)
#define SYS_ANA_REG42_PWD_USB_MASK (0x1)

#define SYS_ANA_REG43_ADDR (SOC_SYS_REG_BASE + (0x6b << 2))

#define SYS_ANA_REG43_EN_LPDAC_A_VOTEST_POS (0)
#define SYS_ANA_REG43_EN_LPDAC_A_VOTEST_MASK (0x1)

#define SYS_ANA_REG43_ACMP_CLR_OUT_A_POS (1)
#define SYS_ANA_REG43_ACMP_CLR_OUT_A_MASK (0x1)

#define SYS_ANA_REG43_ACMP_CHSEL_A_POS (2)
#define SYS_ANA_REG43_ACMP_CHSEL_A_MASK (0xf)

#define SYS_ANA_REG43_ACMP_HYSTSEL_A_POS (6)
#define SYS_ANA_REG43_ACMP_HYSTSEL_A_MASK (0x3)

#define SYS_ANA_REG43_ACMP_NPMD_A_POS (8)
#define SYS_ANA_REG43_ACMP_NPMD_A_MASK (0x1)

#define SYS_ANA_REG43_ACMP_HPMD_A_POS (9)
#define SYS_ANA_REG43_ACMP_HPMD_A_MASK (0x1)

#define SYS_ANA_REG43_EN_ANACOMP_A_POS (10)
#define SYS_ANA_REG43_EN_ANACOMP_A_MASK (0x1)

#define SYS_ANA_REG43_VBG_SEL_LPDAC_A_POS (11)
#define SYS_ANA_REG43_VBG_SEL_LPDAC_A_MASK (0x1)

#define SYS_ANA_REG43_EN_LPDAC_A_POS (12)
#define SYS_ANA_REG43_EN_LPDAC_A_MASK (0x1)

#define SYS_ANA_REG43_COMP_A_VOSEL_POS (13)
#define SYS_ANA_REG43_COMP_A_VOSEL_MASK (0x3)

