bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_reg.h
#define SYS_ANA_REG43_NC_15_15_POS (15)
#define SYS_ANA_REG43_NC_15_15_MASK (0x1)

#define SYS_ANA_REG43_EN_LPDAC_B_VOTEST_POS (16)
#define SYS_ANA_REG43_EN_LPDAC_B_VOTEST_MASK (0x1)

#define SYS_ANA_REG43_ACMP_CLR_OUT_B_POS (17)
#define SYS_ANA_REG43_ACMP_CLR_OUT_B_MASK (0x1)

#define SYS_ANA_REG43_ACMP_CHSEL_B_POS (18)
#define SYS_ANA_REG43_ACMP_CHSEL_B_MASK (0xf)

#define SYS_ANA_REG43_ACMP_HYSTSEL_B_POS (22)
#define SYS_ANA_REG43_ACMP_HYSTSEL_B_MASK (0x3)

#define SYS_ANA_REG43_ACMP_NPMD_B_POS (24)
#define SYS_ANA_REG43_ACMP_NPMD_B_MASK (0x1)

#define SYS_ANA_REG43_ACMP_HPMD_B_POS (25)
#define SYS_ANA_REG43_ACMP_HPMD_B_MASK (0x1)

#define SYS_ANA_REG43_EN_ANACOMP_B_POS (26)
#define SYS_ANA_REG43_EN_ANACOMP_B_MASK (0x1)

#define SYS_ANA_REG43_VBG_SEL_LPDAC_B_POS (27)
#define SYS_ANA_REG43_VBG_SEL_LPDAC_B_MASK (0x1)

#define SYS_ANA_REG43_EN_LPDAC_B_POS (28)
#define SYS_ANA_REG43_EN_LPDAC_B_MASK (0x1)

#define SYS_ANA_REG43_COMP_B_VOSEL_POS (29)
#define SYS_ANA_REG43_COMP_B_VOSEL_MASK (0x3)

#define SYS_ANA_REG43_NC_31_31_POS (31)
#define SYS_ANA_REG43_NC_31_31_MASK (0x1)

#define SYS_ANA_REG44_ADDR (SOC_SYS_REG_BASE + (0x6c << 2))

#define SYS_ANA_REG44_DIN_LPDAC_A_POS (0)
#define SYS_ANA_REG44_DIN_LPDAC_A_MASK (0xff)

#define SYS_ANA_REG44_DIN_LPDAC_B_POS (8)
#define SYS_ANA_REG44_DIN_LPDAC_B_MASK (0xff)

#define SYS_ANA_REG44_NC_16_31_POS (16)
#define SYS_ANA_REG44_NC_16_31_MASK (0xffff)

#define SYS_ANA_REG45_ADDR (SOC_SYS_REG_BASE + (0x6d << 2))

#define SYS_ANA_REG45_NC_0_31_POS (0)
#define SYS_ANA_REG45_NC_0_31_MASK (0xffffffff)

#define SYS_ANA_REG46_ADDR (SOC_SYS_REG_BASE + (0x6e << 2))

#define SYS_ANA_REG46_NC_0_31_POS (0)
#define SYS_ANA_REG46_NC_0_31_MASK (0xffffffff)

#define SYS_ANA_REG47_ADDR (SOC_SYS_REG_BASE + (0x6f << 2))

#define SYS_ANA_REG47_NC_0_31_POS (0)
#define SYS_ANA_REG47_NC_0_31_MASK (0xffffffff)

#ifdef __cplusplus
}
#endif
